[Timeout] BlockStatement
app/(tabs)/index.tsx:17:76
 
 // FOR DEVELOPMENT PURPOSES ONLY------------------
 
-function getRandomInRange(from: number, to: number, fixed: number): number {
-  return parseFloat((Math.random() * (to - from) + from).toFixed(fixed));
-  // .toFixed() returns string, so 'parseFloat' is used to convert to number
-}
+function getRandomInRange(from: number, to: number, fixed: number): number {}
 
 function getRandomImage() {

[Timeout] ArithmeticOperator
app/(tabs)/index.tsx:18:39
 // FOR DEVELOPMENT PURPOSES ONLY------------------
 
 function getRandomInRange(from: number, to: number, fixed: number): number {
-  return parseFloat((Math.random() * (to - from) + from).toFixed(fixed));
+  return parseFloat((Math.random() * (to + from) + from).toFixed(fixed));
   // .toFixed() returns string, so 'parseFloat' is used to convert to number
 }

[Timeout] ArithmeticOperator
app/(tabs)/index.tsx:18:22
 // FOR DEVELOPMENT PURPOSES ONLY------------------
 
 function getRandomInRange(from: number, to: number, fixed: number): number {
-  return parseFloat((Math.random() * (to - from) + from).toFixed(fixed));
+  return parseFloat((Math.random() / (to - from) + from).toFixed(fixed));
   // .toFixed() returns string, so 'parseFloat' is used to convert to number
 }

[Timeout] BlockStatement
app/(tabs)/index.tsx:22:27
   // .toFixed() returns string, so 'parseFloat' is used to convert to number
 }
 
-function getRandomImage() {
-  return `https://picsum.photos/200?random=${Math.floor(Math.random() * 100)}`;
-}
+function getRandomImage() {}
 
 export const dummyData: any[] = [];

[Timeout] ArithmeticOperator
app/(tabs)/index.tsx:23:57
 }
 
 function getRandomImage() {
-  return `https://picsum.photos/200?random=${Math.floor(Math.random() * 100)}`;
+  return `https://picsum.photos/200?random=${Math.floor(Math.random() / 100)}`;
 }
 

[Timeout] ArrayDeclaration
app/(tabs)/index.tsx:26:33
   return `https://picsum.photos/200?random=${Math.floor(Math.random() * 100)}`;
 }
 
-export const dummyData: any[] = [];
+export const dummyData: any[] = ["Stryker was here"];
 
 const sellerDetails: Seller = {

[Timeout] ObjectLiteral
app/(tabs)/index.tsx:28:31
 
 export const dummyData: any[] = [];
 
-const sellerDetails: Seller = {
-  name: "Pepe",
-  about: "I'm Pepe",
-  location: "Mayaguez, Puerto Rico",
-  onProfilePress: () => alert("Profile Clicked"),
-};
+const sellerDetails: Seller = {};
 
 for (let i = 0; i < 21; i++) {

[Survived] StringLiteral
app/(tabs)/index.tsx:31:13
 const sellerDetails: Seller = {
   name: "Pepe",
   about: "I'm Pepe",
-  location: "Mayaguez, Puerto Rico",
+  location: "",
   onProfilePress: () => alert("Profile Clicked"),
 };

[Survived] ArrowFunction
app/(tabs)/index.tsx:32:19
   name: "Pepe",
   about: "I'm Pepe",
   location: "Mayaguez, Puerto Rico",
-  onProfilePress: () => alert("Profile Clicked"),
+  onProfilePress: () => undefined,
 };
 

[Survived] ConditionalExpression
app/(tabs)/index.tsx:35:17
   onProfilePress: () => alert("Profile Clicked"),
 };
 
-for (let i = 0; i < 21; i++) {
+for (let i = 0; false; i++) {
   const frontImage: string = getRandomImage();
   dummyData.push({

[Survived] BlockStatement
app/(tabs)/index.tsx:35:30
   onProfilePress: () => alert("Profile Clicked"),
 };
 
-for (let i = 0; i < 21; i++) {
-  const frontImage: string = getRandomImage();
-  dummyData.push({
-    id: i,
-    title: "Product Title",
-    price: Math.random() * 100,
-    img: frontImage,
-    description: "This is a description for a product.",
-    pictures: [
-      frontImage,
-      getRandomImage(),
-      getRandomImage(),
-      getRandomImage(),
-    ],
-    sellerInfo: sellerDetails,
-    latitude: getRandomInRange(17.9, 18.5, 6), // Latitude range for Puerto Rico
-    longitude: getRandomInRange(-67.3, -65.2, 6), // Longitude range for Puerto Rico
-  });
-}
+for (let i = 0; i < 21; i++) {}
 //---------------------------------
 

[Survived] ArithmeticOperator
app/(tabs)/index.tsx:40:12
   dummyData.push({
     id: i,
     title: "Product Title",
-    price: Math.random() * 100,
+    price: Math.random() / 100,
     img: frontImage,
     description: "This is a description for a product.",

[Survived] ArrayDeclaration
app/(tabs)/index.tsx:43:15
     price: Math.random() * 100,
     img: frontImage,
     description: "This is a description for a product.",
-    pictures: [
-      frontImage,
-      getRandomImage(),
-      getRandomImage(),
-      getRandomImage(),
-    ],
+    pictures: [],
     sellerInfo: sellerDetails,
     latitude: getRandomInRange(17.9, 18.5, 6), // Latitude range for Puerto Rico

[Survived] UnaryOperator
app/(tabs)/index.tsx:51:40
     ],
     sellerInfo: sellerDetails,
     latitude: getRandomInRange(17.9, 18.5, 6), // Latitude range for Puerto Rico
-    longitude: getRandomInRange(-67.3, -65.2, 6), // Longitude range for Puerto Rico
+    longitude: getRandomInRange(-67.3, +65.2, 6), // Longitude range for Puerto Rico
   });
 }

[Survived] UnaryOperator
app/(tabs)/index.tsx:51:33
     ],
     sellerInfo: sellerDetails,
     latitude: getRandomInRange(17.9, 18.5, 6), // Latitude range for Puerto Rico
-    longitude: getRandomInRange(-67.3, -65.2, 6), // Longitude range for Puerto Rico
+    longitude: getRandomInRange(+67.3, -65.2, 6), // Longitude range for Puerto Rico
   });
 }

[Survived] BlockStatement
app/(tabs)/index.tsx:69:41
   category: string;
 }
 
-export default function ListingScreen() {
-  const [data, setData] = useState<Listings[]>([]);
-  return (
-    <View>
-      <View
-        style={{
-          backgroundColor: "#F6F9FF",
-          borderBottomColor: "black",
-          borderBottomWidth: 1,
-        }}
-      >
-        <SearchBar />
-      </View>
-      <ScrollView contentContainerStyle={styles.container}>
-        <FilterMenu setData={setData} />
-        <View style={styles.listingGrid}>
-          {dummyData.map((product) => (
-            <ProductCard key={product.id} {...product} />
-          ))}
-        </View>
-      </ScrollView>
-    </View>
-  );
-}
+export default function ListingScreen() {}
 
 const styles = StyleSheet.create({

[Survived] ArrayDeclaration
app/(tabs)/index.tsx:70:48
 }
 
 export default function ListingScreen() {
-  const [data, setData] = useState<Listings[]>([]);
+  const [data, setData] = useState<Listings[]>(["Stryker was here"]);
   return (
     <View>

[Survived] ObjectLiteral
app/(tabs)/index.tsx:74:16
   return (
     <View>
       <View
-        style={{
-          backgroundColor: "#F6F9FF",
-          borderBottomColor: "black",
-          borderBottomWidth: 1,
-        }}
+        style={{}}
       >
         <SearchBar />

[Survived] ArrowFunction
app/(tabs)/index.tsx:85:26
       <ScrollView contentContainerStyle={styles.container}>
         <FilterMenu setData={setData} />
         <View style={styles.listingGrid}>
-          {dummyData.map((product) => (
-            <ProductCard key={product.id} {...product} />
-          ))}
+          {dummyData.map(() => undefined)}
         </View>
       </ScrollView>

[Survived] ObjectLiteral
app/(tabs)/index.tsx:94:34
   );
 }
 
-const styles = StyleSheet.create({
-  container: {
-    backgroundColor: "#F6F9FF",
-    paddingBottom: 80,
-  },
-  listingGrid: {
-    alignItems: "center",
-    justifyContent: "center",
-    flexWrap: "wrap",
-    flexDirection: "row",
-    gap: 10,
-    paddingVertical: 10,
-    backgroundColor: "#F6F9FF",
-  },
-});
+const styles = StyleSheet.create({});
 

[Survived] ObjectLiteral
app/(tabs)/index.tsx:95:14
 }
 
 const styles = StyleSheet.create({
-  container: {
-    backgroundColor: "#F6F9FF",
-    paddingBottom: 80,
-  },
+  container: {},
   listingGrid: {
     alignItems: "center",

[Survived] StringLiteral
app/(tabs)/index.tsx:100:17
     paddingBottom: 80,
   },
   listingGrid: {
-    alignItems: "center",
+    alignItems: "",
     justifyContent: "center",
     flexWrap: "wrap",

[Survived] StringLiteral
app/(tabs)/index.tsx:102:15
   listingGrid: {
     alignItems: "center",
     justifyContent: "center",
-    flexWrap: "wrap",
+    flexWrap: "",
     flexDirection: "row",
     gap: 10,
