[Killed] BlockStatement
app/(tabs)/login.tsx:19:35
   const [loading, setLoading] = useState(false);
   const [error, setError] = useState("");
 
-  const handleLogin = async () => {
-    setLoading(true);
-    // Stryker disable next-line all
-    console.log("email:", email);
-    // Stryker disable next-line all
-    console.log("password:", password);
-    const response = await login(email, password);
-    setLoading(false);
-
-    if (response.error) {
-      setError(response.error);
-
-    }
-
-    else if (error !== "")  // Stryker disable next-line all
-    {
-      setError("");
-      // Stryker disable next-line all
-      console.log("User logged in:", response.user);
-
-    }
-
-  };
+  const handleLogin = async () => {};
 
killedBy: LoginScreen 9. displays error message if login fails
statusReason: Error: Unable to find an element with testID: error-message

<View>
  <Text
    testID="login-title"
  >
    Login
  </Text>

[Killed] BlockStatement
app/(tabs)/login.tsx:28:25
     const response = await login(email, password);
     setLoading(false);
 
-    if (response.error) {
-      setError(response.error);
-
-    }
+    if (response.error) {}
 
     else if (error !== "")  // Stryker disable next-line all
killedBy: LoginScreen 9. displays error message if login fails
statusReason: Error: Unable to find an element with testID: error-message

<View>
  <Text
    testID="login-title"
  >
    Login
  </Text>

[Killed] EqualityOperator
app/(tabs)/login.tsx:33:14
 
     }
 
-    else if (error !== "")  // Stryker disable next-line all
+    else if (error === "")  // Stryker disable next-line all
     {
       setError("");
killedBy: LoginScreen 11. error branch only triggers with invalid credentials
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
app/(tabs)/login.tsx:33:14
 
     }
 
-    else if (error !== "")  // Stryker disable next-line all
+    else if (true)  // Stryker disable next-line all
     {
       setError("");
killedBy: LoginScreen 11. error branch only triggers with invalid credentials
statusReason: Error: expect(received).toBeNull()
