[Survived] LogicalOperator
app/(auth)/signup.tsx:21:9
   const [password, setPassword] = useState("");
 
   const handleSignup = async () => {
-    if (!email || !password || !name || !username) {
+    if (!email && !password || !name || !username) {
       Alert.alert("Error", "Please fill all fields");
       return;

[Survived] BlockStatement
app/(auth)/signup.tsx:26:9
       return;
     }
 
-    try {
-      const userCredential = await createUserWithEmailAndPassword(
-        auth,
-        email,
-        password
-      );
-      const user = userCredential.user;
-
-      await setDoc(doc(db, "users", user.uid), {
-        name,
-        username,
-        email,
-        createdAt: new Date(),
-      });
-
-      Alert.alert("Success", "Account created successfully!");
-    } catch (error) {
+    try {} catch (error) {
       Alert.alert("Error", (error as any).message);
     }

[Survived] StringLiteral
app/(auth)/signup.tsx:34:28
       );
       const user = userCredential.user;
 
-      await setDoc(doc(db, "users", user.uid), {
+      await setDoc(doc(db, "", user.uid), {
         name,
         username,

[Survived] BlockStatement
app/(auth)/signup.tsx:42:21
       });
 
       Alert.alert("Success", "Account created successfully!");
-    } catch (error) {
-      Alert.alert("Error", (error as any).message);
-    }
+    } catch (error) {}
   };
 

[Survived] StringLiteral
app/(auth)/signup.tsx:43:19
 
       Alert.alert("Success", "Account created successfully!");
     } catch (error) {
-      Alert.alert("Error", (error as any).message);
+      Alert.alert("", (error as any).message);
     }
   };

[Survived] ObjectLiteral
app/(auth)/signup.tsx:100:10
     alignItems: "center",
     padding: 20,
   },
-  title: {
-    fontSize: 32,
-    fontWeight: "bold",
-    marginBottom: 20,
-    fontFamily: "Calibri",
-  },
+  title: {},
   form: {
     width: "100%",

[Survived] StringLiteral
app/(auth)/signup.tsx:115:18
     padding: 10,
     marginVertical: 8,
     borderWidth: 1,
-    borderColor: "black",
+    borderColor: "",
     borderRadius: 15,
     backgroundColor: "#F6F9FF",

[Survived] StringLiteral
app/(auth)/signup.tsx:124:17
     backgroundColor: "#F45D5D",
     padding: 12,
     borderRadius: 15,
-    alignItems: "center",
+    alignItems: "",
     marginTop: 10,
   },

[Survived] ObjectLiteral
app/(auth)/signup.tsx:127:15
     alignItems: "center",
     marginTop: 10,
   },
-  buttonText: {
-    color: "#fff",
-    fontSize: 20,
-    fontWeight: "bold",
-  },
+  buttonText: {},
   loginText: {
     marginTop: 20,

[Survived] ObjectLiteral
app/(auth)/signup.tsx:135:9
   loginText: {
     marginTop: 20,
   },
-  link: {
-    color: "blue",
-    textDecorationLine: "underline",
-  },
+  link: {},
 });
 
