[Survived] BooleanLiteral
app/(tabs)/login.tsx:16:42
 const LoginScreen = () => {
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
-  const [loading, setLoading] = useState(false);
+  const [loading, setLoading] = useState(true);
   const [error, setError] = useState("");
 

[Survived] BlockStatement
app/(tabs)/login.tsx:19:35
   const [loading, setLoading] = useState(false);
   const [error, setError] = useState("");
 
-  const handleLogin = async () => {
-    setLoading(true);
-    console.log("email:", email);
-    console.log("password:", password);
-    const response = await login(email, password);
-    setLoading(false);
-
-    if (response.error) {
-      setError(response.error);
-    } else {
-      console.log("User logged in:", response.user);
-    }
-  };
+  const handleLogin = async () => {};
 
   return (

[Survived] StringLiteral
app/(tabs)/login.tsx:22:17
   const handleLogin = async () => {
     setLoading(true);
     console.log("email:", email);
-    console.log("password:", password);
+    console.log("", password);
     const response = await login(email, password);
     setLoading(false);

[Survived] BooleanLiteral
app/(tabs)/login.tsx:24:16
     console.log("email:", email);
     console.log("password:", password);
     const response = await login(email, password);
-    setLoading(false);
+    setLoading(true);
 
     if (response.error) {

[Survived] BlockStatement
app/(tabs)/login.tsx:26:25
     const response = await login(email, password);
     setLoading(false);
 
-    if (response.error) {
-      setError(response.error);
-    } else {
+    if (response.error) {} else {
       console.log("User logged in:", response.user);
     }

[Survived] BlockStatement
app/(tabs)/login.tsx:28:12
 
     if (response.error) {
       setError(response.error);
-    } else {
-      console.log("User logged in:", response.user);
-    }
+    } else {}
   };
 

[Survived] StringLiteral
app/(tabs)/login.tsx:75:21
   container: {
     flex: 1,
     backgroundColor: "#F6F9FF",
-    justifyContent: "center",
+    justifyContent: "",
     alignItems: "center",
     padding: 20,

[Survived] StringLiteral
app/(tabs)/login.tsx:86:12
     fontFamily: "Calibri",
   },
   form: {
-    width: "100%",
+    width: "",
     maxWidth: 400,
   },

[Survived] ObjectLiteral
app/(tabs)/login.tsx:89:10
     width: "100%",
     maxWidth: 400,
   },
-  input: {
-    width: "100%",
-    padding: 10,
-    marginVertical: 8,
-    borderWidth: 1,
-    borderColor: "black",
-    borderRadius: 15,
-    backgroundColor: "#F6F9FF",
-    fontFamily: "Calibri",
-  },
+  input: {},
   button: {
     backgroundColor: "#F45D5D",
