[Survived] StringLiteral
app/(tabs)/ListItem.tsx:10:38
 import Buttons from '@/components/ListAnItem/Buttons';
 
 export default function ListItem() {
-    const [text, setText] = useState('');
+    const [text, setText] = useState("Stryker was here!");
     return (
         <View style={styles.container}>

[Survived] ArrowFunction
app/(tabs)/ListItem.tsx:16:46
             {/* Top Bar */}
             <View style={styles.topBar}>
                 <TouchableOpacity style={{padding: 10}}
-                                    onPress={() => alert('Pressed on Back button.')}>
+                                    onPress={() => undefined}>
                     <Text>←</Text>
                 </TouchableOpacity>

[Survived] StringLiteral
app/(tabs)/ListItem.tsx:16:58
             {/* Top Bar */}
             <View style={styles.topBar}>
                 <TouchableOpacity style={{padding: 10}}
-                                    onPress={() => alert('Pressed on Back button.')}>
+                                    onPress={() => alert("")}>
                     <Text>←</Text>
                 </TouchableOpacity>

[Survived] BooleanLiteral
app/(tabs)/ListItem.tsx:34:36
                         value={text}
                         onChangeText={setText}
                         textAlignVertical='top'
-                        multiline={true}/>
+                        multiline={false}/>
                 </View>
                 {/*Divider*/}

[Survived] StringLiteral
app/(tabs)/ListItem.tsx:53:26
 
 const styles = StyleSheet.create({
     container: {
-        backgroundColor: 'white',
+        backgroundColor: "",
         flex:1,
     },

[Survived] ObjectLiteral
app/(tabs)/ListItem.tsx:67:17
         shadowOpacity: 0.1,
         shadowRadius: 4,
     },
-    scrollView: {
-        flexGrow: 1,
-        paddingBottom: 120,
-    },
+    scrollView: {},
     picturesSection: {
         padding: 5,

[Survived] ObjectLiteral
app/(tabs)/ListItem.tsx:74:23
     picturesSection: {
         padding: 5,
     },
-    descriptionInput: {
-        height: 130,
-        borderRadius: 5,
-        borderWidth: 2,
-        borderColor: '#E4AAAA',
-    },
+    descriptionInput: {},
 }
 )
