[Survived] StringLiteral
app/login/signup.tsx:26:36
 const db = getFirestore(app);
 
 export default function Signup() {
-  const [name, setName] = useState("");
+  const [name, setName] = useState("Stryker was here!");
   const [username, setUsername] = useState("");
   const [email, setEmail] = useState("");

[Survived] StringLiteral
app/login/signup.tsx:27:44
 
 export default function Signup() {
   const [name, setName] = useState("");
-  const [username, setUsername] = useState("");
+  const [username, setUsername] = useState("Stryker was here!");
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");

[Survived] ConditionalExpression
app/login/signup.tsx:33:9
   const [verificationSent, setVerificationSent] = useState(false);
 
   const handleSignup = async () => {
-    if (!email || !password || !name || !username) {
+    if (true) {
       Alert.alert("Error", "Please fill all fields");
       return;

[Survived] ObjectLiteral
app/login/signup.tsx:51:48
       await sendEmailVerification(auth.currentUser);
       setVerificationSent(true);
 
-      await setDoc(doc(db, "users", user.uid), {
-        name,
-        username,
-        email,
-        createdAt: new Date(),
-      });
+      await setDoc(doc(db, "users", user.uid), {});
 
       Alert.alert("Success", "Sign-up successful! Please check your email for verification.");

[Survived] StringLiteral
app/login/signup.tsx:74:21
         await sendEmailVerification(auth.currentUser);
         Alert.alert("Success", "Verification email sent. Please check your inbox.");
       } catch (error: any) {
-        Alert.alert("Error", "Failed to send verification email.");
+        Alert.alert("", "Failed to send verification email.");
       }
     }

[Survived] ObjectLiteral
app/login/signup.tsx:155:9
     marginBottom: 20,
     fontFamily: "Calibri",
   },
-  form: {
-    width: "100%",
-    maxWidth: 400,
-    backgroundColor: "#F6F9FF",
-  },
+  form: {},
   input: {
     width: "100%",

[Survived] ObjectLiteral
app/login/signup.tsx:160:10
     maxWidth: 400,
     backgroundColor: "#F6F9FF",
   },
-  input: {
-    width: "100%",
-    padding: 10,
-    marginVertical: 8,
-    borderWidth: 1,
-    borderColor: "black",
-    borderRadius: 5,
-    backgroundColor: "#F6F9FF",
-    fontFamily: "Calibri",
-    color: "black",
-  },
+  input: {},
   
   button: {

[Survived] StringLiteral
app/login/signup.tsx:167:22
     borderWidth: 1,
     borderColor: "black",
     borderRadius: 5,
-    backgroundColor: "#F6F9FF",
+    backgroundColor: "",
     fontFamily: "Calibri",
     color: "black",

[Survived] StringLiteral
app/login/signup.tsx:169:12
     borderRadius: 5,
     backgroundColor: "#F6F9FF",
     fontFamily: "Calibri",
-    color: "black",
+    color: "",
   },
   

[Survived] ObjectLiteral
app/login/signup.tsx:172:11
     color: "black",
   },
   
-  button: {
-    backgroundColor: "black",
-    padding: 12,
-    borderRadius: 5,
-    alignItems: "center",
-    marginTop: 10,
-  },
+  button: {},
   buttonText: {
     color: "#fff",

[Survived] StringLiteral
app/login/signup.tsx:188:12
     marginTop: 20,
   },
   link: {
-    color: "black",
+    color: "",
     fontWeight: "bold",
   },
