[Survived] StringLiteral
app/(tabs)/main_page.tsx:10:47
     <ScrollView style={styles.container}>
       {/* Header */}
       <View style={styles.header}>
-        <Text style={styles.title}>Welcome to{"\n"}Thrift Uni</Text>
+        <Text style={styles.title}>Welcome to{""}Thrift Uni</Text>
       </View>
 

[Survived] BlockStatement
app/(tabs)/main_page.tsx:36:68
 };
 
 // Button Component
-const Button = ({ icon, text }: { icon: string; text: string }) => {
-  return (
-    <TouchableOpacity style={styles.button}>
-      <FontAwesome name={icon as any} size={28} color="black" />
-      <Text style={styles.buttonText}>{text}</Text>
-    </TouchableOpacity>
-  );
-};
+const Button = ({ icon, text }: { icon: string; text: string }) => {};
 
 // Styles

[Survived] StringLiteral
app/(tabs)/main_page.tsx:49:22
 const styles = StyleSheet.create({
   container: {
     flex: 1,
-    backgroundColor: "#E5E5E5", // Bright green background
+    backgroundColor: "", // Bright green background
     paddingVertical: 20,
   },

[Survived] ObjectLiteral
app/(tabs)/main_page.tsx:63:20
     color: "black",
     textAlign: "center",
   },
-  searchContainer: {
-    backgroundColor: "white",
-    flexDirection: "row",
-    alignItems: "center",
-    paddingHorizontal: 15,
-    paddingVertical: 10,
-    borderRadius: 50,
-    marginHorizontal: 20,
-    shadowColor: "#000",
-    shadowOpacity: 0.1,
-    shadowRadius: 5,
-    elevation: 5,
-  },
+  searchContainer: {},
   icon: {
     marginRight: 10,

[Survived] StringLiteral
app/(tabs)/main_page.tsx:65:20
   },
   searchContainer: {
     backgroundColor: "white",
-    flexDirection: "row",
+    flexDirection: "",
     alignItems: "center",
     paddingHorizontal: 15,

[Survived] StringLiteral
app/(tabs)/main_page.tsx:66:17
   searchContainer: {
     backgroundColor: "white",
     flexDirection: "row",
-    alignItems: "center",
+    alignItems: "",
     paddingHorizontal: 15,
     paddingVertical: 10,

[Survived] ObjectLiteral
app/(tabs)/main_page.tsx:76:9
     shadowRadius: 5,
     elevation: 5,
   },
-  icon: {
-    marginRight: 10,
-  },
+  icon: {},
   input: {
     flex: 1,

[Survived] StringLiteral
app/(tabs)/main_page.tsx:89:20
     paddingHorizontal: 20,
   },
   row: {
-    flexDirection: "row",
+    flexDirection: "",
     justifyContent: "space-between",
     marginBottom: 15,

[Survived] StringLiteral
app/(tabs)/main_page.tsx:94:22
     marginBottom: 15,
   },
   button: {
-    backgroundColor: "#FFFF",
+    backgroundColor: "",
     flex: 1,
     marginHorizontal: 10,

[Survived] ObjectLiteral
app/(tabs)/main_page.tsx:102:15
     alignItems: "center",
     justifyContent: "center",
   },
-  buttonText: {
-    marginTop: 5,
-    fontSize: 16,
-    fontWeight: "500",
-    color: "black",
-  },
+  buttonText: {},
 });
 

[Survived] StringLiteral
app/(tabs)/main_page.tsx:105:17
   buttonText: {
     marginTop: 5,
     fontSize: 16,
-    fontWeight: "500",
+    fontWeight: "",
     color: "black",
   },

[Survived] StringLiteral
app/(tabs)/main_page.tsx:106:12
     marginTop: 5,
     fontSize: 16,
     fontWeight: "500",
-    color: "black",
+    color: "",
   },
 });
