[Survived] ObjectLiteral
firebase/auth.tsx:13:66
 const auth = getAuth();
 
 export const useGoogleSignIn = () => {
-  const [request, response, promptAsync] = Google.useAuthRequest({
-    webClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_WEB,
-    iosClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_IOS,
-    androidClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_ANDROID,
-    scopes: ['openid', 'profile', 'email'],
-    responseType: "id_token",
-  });
+  const [request, response, promptAsync] = Google.useAuthRequest({});
 
   useEffect(() => {

[Survived] StringLiteral
firebase/auth.tsx:17:14
     webClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_WEB,
     iosClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_IOS,
     androidClientId: process.env.EXPO_PUBLIC_GOOGLE_CLIENT_ID_ANDROID,
-    scopes: ['openid', 'profile', 'email'],
+    scopes: ["", 'profile', 'email'],
     responseType: "id_token",
   });

[Survived] BlockStatement
firebase/auth.tsx:21:19
     responseType: "id_token",
   });
 
-  useEffect(() => {
-    if (Platform.OS !== 'web') {
-      console.warn("Google Sign-In is only available on the web.");
-      return;
-    }
-
-    if (response?.type === 'success') {
-      const { id_token } = response.params;
-      const credential = GoogleAuthProvider.credential(id_token);
-
-      signInWithCredential (auth, credential)
-        .then((userCredential) => console.log("Usuario autenticado:", userCredential.user))
-        .catch((error) => console.error("Error en la autenticación web:", error.message));
-    }
-  }, [response]);
+  useEffect(() => {}, [response]);
 
   return { request, promptAsync };

[Survived] BlockStatement
firebase/auth.tsx:22:32
   });
 
   useEffect(() => {
-    if (Platform.OS !== 'web') {
-      console.warn("Google Sign-In is only available on the web.");
-      return;
-    }
+    if (Platform.OS !== 'web') {}
 
     if (response?.type === 'success') {

[Survived] ConditionalExpression
firebase/auth.tsx:22:9
   });
 
   useEffect(() => {
-    if (Platform.OS !== 'web') {
+    if (false) {
       console.warn("Google Sign-In is only available on the web.");
       return;

[Survived] BlockStatement
firebase/auth.tsx:27:39
       return;
     }
 
-    if (response?.type === 'success') {
-      const { id_token } = response.params;
-      const credential = GoogleAuthProvider.credential(id_token);
-
-      signInWithCredential (auth, credential)
-        .then((userCredential) => console.log("Usuario autenticado:", userCredential.user))
-        .catch((error) => console.error("Error en la autenticación web:", error.message));
-    }
+    if (response?.type === 'success') {}
   }, [response]);
 

[Survived] OptionalChaining
firebase/auth.tsx:27:9
       return;
     }
 
-    if (response?.type === 'success') {
+    if (response.type === 'success') {
       const { id_token } = response.params;
       const credential = GoogleAuthProvider.credential(id_token);

[Survived] ArrowFunction
firebase/auth.tsx:32:15
       const credential = GoogleAuthProvider.credential(id_token);
 
       signInWithCredential (auth, credential)
-        .then((userCredential) => console.log("Usuario autenticado:", userCredential.user))
+        .then(() => undefined)
         .catch((error) => console.error("Error en la autenticación web:", error.message));
     }

[Survived] ArrowFunction
firebase/auth.tsx:33:16
 
       signInWithCredential (auth, credential)
         .then((userCredential) => console.log("Usuario autenticado:", userCredential.user))
-        .catch((error) => console.error("Error en la autenticación web:", error.message));
+        .catch(() => undefined);
     }
   }, [response]);
