[Survived] StringLiteral
app/(tabs)/my_listings.tsx:8:96
 
 export default function DisplayMyListing() {
   const [listings, setListings] = useState([
-    { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: 'Pending' },
+    { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: "" },
     { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
   ]);

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:8:22
 
 export default function DisplayMyListing() {
   const [listings, setListings] = useState([
-    { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: 'Pending' },
+    { id: '1', name: "", details: 'Details about product', price: '$10.05', status: 'Pending' },
     { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
   ]);

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:9:78
 export default function DisplayMyListing() {
   const [listings, setListings] = useState([
     { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: 'Pending' },
-    { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
+    { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: "", status: 'Sold' }
   ]);
   const [filter, setFilter] = useState('All');

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:9:95
 export default function DisplayMyListing() {
   const [listings, setListings] = useState([
     { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: 'Pending' },
-    { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
+    { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: "" }
   ]);
   const [filter, setFilter] = useState('All');

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:11:40
     { id: '1', name: 'Lorem Ipsum', details: 'Details about product', price: '$10.05', status: 'Pending' },
     { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
   ]);
-  const [filter, setFilter] = useState('All');
+  const [filter, setFilter] = useState("");
   const [isEditing, setIsEditing] = useState(false);
 

[Survived] BooleanLiteral
app/(tabs)/my_listings.tsx:12:46
     { id: '2', name: 'Lorem Ipsum', details: 'Details about product', price: '$5.05', status: 'Sold' }
   ]);
   const [filter, setFilter] = useState('All');
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
 
   const handleFilter = (status: React.SetStateAction<string>) => {

[Survived] BlockStatement
app/(tabs)/my_listings.tsx:14:66
   const [filter, setFilter] = useState('All');
   const [isEditing, setIsEditing] = useState(false);
 
-  const handleFilter = (status: React.SetStateAction<string>) => {
-    setFilter(status);
-  };
+  const handleFilter = (status: React.SetStateAction<string>) => {};
 
   const handleDelete = (id: string) => {

[Survived] BlockStatement
app/(tabs)/my_listings.tsx:18:40
     setFilter(status);
   };
 
-  const handleDelete = (id: string) => {
-    setListings((prevListings) => prevListings.filter(listing => listing.id !== id));
-  };
+  const handleDelete = (id: string) => {};
 
   const filteredListings = filter === 'All' ? listings : listings.filter(listing => listing.status === filter);

[Survived] MethodExpression
app/(tabs)/my_listings.tsx:19:35
   };
 
   const handleDelete = (id: string) => {
-    setListings((prevListings) => prevListings.filter(listing => listing.id !== id));
+    setListings((prevListings) => prevListings);
   };
 

[Survived] ArrowFunction
app/(tabs)/my_listings.tsx:19:55
   };
 
   const handleDelete = (id: string) => {
-    setListings((prevListings) => prevListings.filter(listing => listing.id !== id));
+    setListings((prevListings) => prevListings.filter(() => undefined));
   };
 

[Survived] ConditionalExpression
app/(tabs)/my_listings.tsx:22:85
     setListings((prevListings) => prevListings.filter(listing => listing.id !== id));
   };
 
-  const filteredListings = filter === 'All' ? listings : listings.filter(listing => listing.status === filter);
+  const filteredListings = filter === 'All' ? listings : listings.filter(listing => true);
 
   return (

[Survived] ConditionalExpression
app/(tabs)/my_listings.tsx:22:28
     setListings((prevListings) => prevListings.filter(listing => listing.id !== id));
   };
 
-  const filteredListings = filter === 'All' ? listings : listings.filter(listing => listing.status === filter);
+  const filteredListings = true ? listings : listings.filter(listing => listing.status === filter);
 
   return (

[Survived] EqualityOperator
app/(tabs)/my_listings.tsx:29:78
       <View style={styles.header}><Text style={styles.header_text}>My Listing</Text></View>
       <View style={styles.body}>
         <View style={styles.upper_buttons_container}>
-          <Pressable style={styles.upper_button} onPress={() => handleFilter(filter === 'All' ? 'Sold' : 'All')}>
+          <Pressable style={styles.upper_button} onPress={() => handleFilter(filter !== 'All' ? 'Sold' : 'All')}>
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>

[Survived] ConditionalExpression
app/(tabs)/my_listings.tsx:29:78
       <View style={styles.header}><Text style={styles.header_text}>My Listing</Text></View>
       <View style={styles.body}>
         <View style={styles.upper_buttons_container}>
-          <Pressable style={styles.upper_button} onPress={() => handleFilter(filter === 'All' ? 'Sold' : 'All')}>
+          <Pressable style={styles.upper_button} onPress={() => handleFilter(true ? 'Sold' : 'All')}>
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>

[Survived] ArrowFunction
app/(tabs)/my_listings.tsx:32:59
           <Pressable style={styles.upper_button} onPress={() => handleFilter(filter === 'All' ? 'Sold' : 'All')}>
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>
-          <Pressable style={styles.upper_button} onPress={() => setIsEditing(!isEditing)}>
+          <Pressable style={styles.upper_button} onPress={() => undefined}>
             <Text style={styles.upper_button_text}>{isEditing ? 'Done' : 'Edit'}</Text>
           </Pressable>

[Survived] BooleanLiteral
app/(tabs)/my_listings.tsx:32:78
           <Pressable style={styles.upper_button} onPress={() => handleFilter(filter === 'All' ? 'Sold' : 'All')}>
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>
-          <Pressable style={styles.upper_button} onPress={() => setIsEditing(!isEditing)}>
+          <Pressable style={styles.upper_button} onPress={() => setIsEditing(isEditing)}>
             <Text style={styles.upper_button_text}>{isEditing ? 'Done' : 'Edit'}</Text>
           </Pressable>

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:33:74
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>
           <Pressable style={styles.upper_button} onPress={() => setIsEditing(!isEditing)}>
-            <Text style={styles.upper_button_text}>{isEditing ? 'Done' : 'Edit'}</Text>
+            <Text style={styles.upper_button_text}>{isEditing ? 'Done' : ""}</Text>
           </Pressable>
         </View>

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:33:65
             <Text style={styles.upper_button_text}>{filter}</Text>
           </Pressable>
           <Pressable style={styles.upper_button} onPress={() => setIsEditing(!isEditing)}>
-            <Text style={styles.upper_button_text}>{isEditing ? 'Done' : 'Edit'}</Text>
+            <Text style={styles.upper_button_text}>{isEditing ? "" : 'Edit'}</Text>
           </Pressable>
         </View>

[Survived] ArrowFunction
app/(tabs)/my_listings.tsx:38:25
         </View>
         <FlatList
           data={filteredListings}
-          keyExtractor={(item) => item.id}
+          keyExtractor={() => undefined}
           renderItem={({ item }) => (
             <View style={styles.card}>

[Survived] ArrowFunction
app/(tabs)/my_listings.tsx:39:23
         <FlatList
           data={filteredListings}
           keyExtractor={(item) => item.id}
-          renderItem={({ item }) => (
-            <View style={styles.card}>
-              <Image source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
-              <View style={styles.card_information}>
-                <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>
-                <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.details}</Text>
-                <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>
-              </View>
-              <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>
-              {isEditing && (
-                <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
-                  <Text style={{ color: 'white' }}>Delete</Text>
-                </Pressable>
-              )}
-            </View>
-          )}
+          renderItem={() => undefined}
         />
       </View>

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:41:30
           keyExtractor={(item) => item.id}
           renderItem={({ item }) => (
             <View style={styles.card}>
-              <Image source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
+              <Image source={{}} style={styles.image} />
               <View style={styles.card_information}>
                 <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:43:30
             <View style={styles.card}>
               <Image source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
               <View style={styles.card_information}>
-                <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>
+                <Text style={{}}>{item.name}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.details}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:43:53
             <View style={styles.card}>
               <Image source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
               <View style={styles.card_information}>
-                <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>
+                <Text style={{ fontSize: 25, color: "", margin: 5 }}>{item.name}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.details}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:44:53
               <Image source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
               <View style={styles.card_information}>
                 <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>
-                <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.details}</Text>
+                <Text style={{ fontSize: 15, color: "", margin: 5 }}>{item.details}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>
               </View>

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:45:30
               <View style={styles.card_information}>
                 <Text style={{ fontSize: 25, color: "#000", margin: 5 }}>{item.name}</Text>
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.details}</Text>
-                <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>
+                <Text style={{}}>{item.price}</Text>
               </View>
               <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>

[Survived] LogicalOperator
app/(tabs)/my_listings.tsx:48:16
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>
               </View>
               <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>
-              {isEditing && (
-                <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
-                  <Text style={{ color: 'white' }}>Delete</Text>
-                </Pressable>
-              )}
+              {isEditing || <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
+                  <Text style={{
+    color: 'white'
+  }}>Delete</Text>
+                </Pressable>}
             </View>
           )}

[Survived] ConditionalExpression
app/(tabs)/my_listings.tsx:48:16
                 <Text style={{ fontSize: 15, color: "#000", margin: 5 }}>{item.price}</Text>
               </View>
               <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>
-              {isEditing && (
-                <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
-                  <Text style={{ color: 'white' }}>Delete</Text>
-                </Pressable>
-              )}
+              {false}
             </View>
           )}

[Survived] ArrowFunction
app/(tabs)/my_listings.tsx:49:37
               </View>
               <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>
               {isEditing && (
-                <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
+                <Pressable onPress={() => undefined} style={styles.deleteButton}>
                   <Text style={{ color: 'white' }}>Delete</Text>
                 </Pressable>

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:50:41
               <Text style={{ marginLeft: 'auto', marginRight: 25, fontSize: 10, color: "#000" }}>{item.status}</Text>
               {isEditing && (
                 <Pressable onPress={() => handleDelete(item.id)} style={styles.deleteButton}>
-                  <Text style={{ color: 'white' }}>Delete</Text>
+                  <Text style={{ color: "" }}>Delete</Text>
                 </Pressable>
               )}

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:62:14
 }
 
 const styles = StyleSheet.create({
-  container: {
-    flex: 1,
-    backgroundColor: 'white',
-  },
+  container: {},
   header: {
     textAlign: 'center',

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:67:16
     backgroundColor: 'white',
   },
   header: {
-    textAlign: 'center',
+    textAlign: "",
     borderBottomColor: '#000',
     borderBottomWidth: 1,

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:80:22
   body: {
     flex: 1,
     padding: 20,
-    backgroundColor: "#F6F9FF",
+    backgroundColor: "",
   },
   upper_buttons_container: {

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:84:21
   },
   upper_buttons_container: {
     flexDirection: 'row',
-    justifyContent: 'space-between',
+    justifyContent: "",
     marginBottom: 20,
     backgroundColor: "#F6F9FF",

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:90:18
   },
   upper_button: {
     padding: 10,
-    borderColor: '#000',
+    borderColor: "",
     borderWidth: 1,
     borderRadius: 10,

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:97:12
   },
   upper_button_text: {
     fontSize: 20,
-    color: '#000',
+    color: "",
   },
   card: {

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:99:9
     fontSize: 20,
     color: '#000',
   },
-  card: {
-    flexDirection: 'row',
-    alignItems: 'center',
-    borderColor: "#000",
-    borderWidth: 1,
-    borderRadius: 10,
-    padding: 10,
-    marginBottom: 10,
-    backgroundColor: "#fff",
-  },
+  card: {},
   card_information: {
     flex: 1,

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:100:20
     color: '#000',
   },
   card: {
-    flexDirection: 'row',
+    flexDirection: "",
     alignItems: 'center',
     borderColor: "#000",

[Survived] StringLiteral
app/(tabs)/my_listings.tsx:102:18
   card: {
     flexDirection: 'row',
     alignItems: 'center',
-    borderColor: "#000",
+    borderColor: "",
     borderWidth: 1,
     borderRadius: 10,

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:109:21
     marginBottom: 10,
     backgroundColor: "#fff",
   },
-  card_information: {
-    flex: 1,
-    backgroundColor: "#fff",
-  },
+  card_information: {},
   image: {
     width: 80,

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:113:10
     flex: 1,
     backgroundColor: "#fff",
   },
-  image: {
-    width: 80,
-    height: 80,
-    marginRight: 10,
-  },
+  image: {},
   deleteButton: {
     backgroundColor: 'red',

[Survived] ObjectLiteral
app/(tabs)/my_listings.tsx:118:17
     height: 80,
     marginRight: 10,
   },
-  deleteButton: {
-    backgroundColor: 'red',
-    padding: 5,
-    borderRadius: 5,
-  }
+  deleteButton: {}
 });
