[Survived] ArrowFunction
app/(tabs)/Profile.tsx:19:55
   value: number;
 }
 
-const ProfileHeader: React.FC<{ username: string }> = ({ username }) => (
-  <View style={styles.header}>
-    <Text style={styles.username}>{username}</Text>
-    <View style={styles.headerButtons}>
-      <TouchableOpacity>
-        <Ionicons name="add-circle-outline" size={24} color="black" />
-      </TouchableOpacity>
-      <TouchableOpacity onPress={() => router.push('/settings')}>
-        <Ionicons name="menu" size={24} color="black" />
-      </TouchableOpacity>
-    </View>
-  </View>
-);
+const ProfileHeader: React.FC<{ username: string }> = () => undefined;
 
 const ProfileStats: React.FC<{ stats: ProfileStatsItem[] }> = ({ stats }) => (

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:26:34
       <TouchableOpacity>
         <Ionicons name="add-circle-outline" size={24} color="black" />
       </TouchableOpacity>
-      <TouchableOpacity onPress={() => router.push('/settings')}>
+      <TouchableOpacity onPress={() => undefined}>
         <Ionicons name="menu" size={24} color="black" />
       </TouchableOpacity>

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:33:63
   </View>
 );
 
-const ProfileStats: React.FC<{ stats: ProfileStatsItem[] }> = ({ stats }) => (
-  <View style={styles.profileInfo}>
-    <View style={styles.profileImagePlaceholder}>
-      <Ionicons name="person-circle-outline" size={80} color="#ccc" />
-    </View>
-    <View style={styles.stats}>
-      {stats.map(({ label, value }) => (
-        <View key={label} style={styles.statItem}>
-          <Text style={styles.statNumber}>{value}</Text>
-          <Text style={styles.infoText}>{label}</Text>
-        </View>
-      ))}
-    </View>
-  </View>
-);
+const ProfileStats: React.FC<{ stats: ProfileStatsItem[] }> = () => undefined;
 
 const TabToggle: React.FC<{

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:39:18
       <Ionicons name="person-circle-outline" size={80} color="#ccc" />
     </View>
     <View style={styles.stats}>
-      {stats.map(({ label, value }) => (
-        <View key={label} style={styles.statItem}>
-          <Text style={styles.statNumber}>{value}</Text>
-          <Text style={styles.infoText}>{label}</Text>
-        </View>
-      ))}
+      {stats.map(() => undefined)}
     </View>
   </View>

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:53:6
   tabs: TabConfig[];
   activeTab: TabKey;
   onTabChange: (tab: TabKey) => void;
-}> = ({ tabs, activeTab, onTabChange }) => (
-  <View style={styles.toggleButtons}>
-    {tabs.map((tab) => (
-      <TouchableOpacity
-        key={tab.key}
-        style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
-        onPress={() => onTabChange(tab.key)}
-      >
-        <Text style={activeTab === tab.key ? styles.activeText : undefined}>
-          {tab.label}
-        </Text>
-      </TouchableOpacity>
-    ))}
-  </View>
-);
+}> = () => undefined;
 
 const ListingsSection: React.FC<{

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:55:15
   onTabChange: (tab: TabKey) => void;
 }> = ({ tabs, activeTab, onTabChange }) => (
   <View style={styles.toggleButtons}>
-    {tabs.map((tab) => (
-      <TouchableOpacity
-        key={tab.key}
-        style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
-        onPress={() => onTabChange(tab.key)}
-      >
-        <Text style={activeTab === tab.key ? styles.activeText : undefined}>
-          {tab.label}
-        </Text>
-      </TouchableOpacity>
-    ))}
+    {tabs.map(() => undefined)}
   </View>
 );

[Survived] EqualityOperator
app/(tabs)/Profile.tsx:58:38
     {tabs.map((tab) => (
       <TouchableOpacity
         key={tab.key}
-        style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
+        style={[styles.toggleButton, activeTab !== tab.key && styles.activeButton]}
         onPress={() => onTabChange(tab.key)}
       >

[Survived] ConditionalExpression
app/(tabs)/Profile.tsx:58:38
     {tabs.map((tab) => (
       <TouchableOpacity
         key={tab.key}
-        style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
+        style={[styles.toggleButton, true]}
         onPress={() => onTabChange(tab.key)}
       >

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:59:18
       <TouchableOpacity
         key={tab.key}
         style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
-        onPress={() => onTabChange(tab.key)}
+        onPress={() => undefined}
       >
         <Text style={activeTab === tab.key ? styles.activeText : undefined}>

[Survived] ConditionalExpression
app/(tabs)/Profile.tsx:61:22
         style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
         onPress={() => onTabChange(tab.key)}
       >
-        <Text style={activeTab === tab.key ? styles.activeText : undefined}>
+        <Text style={true ? styles.activeText : undefined}>
           {tab.label}
         </Text>

[Survived] EqualityOperator
app/(tabs)/Profile.tsx:61:22
         style={[styles.toggleButton, activeTab === tab.key && styles.activeButton]}
         onPress={() => onTabChange(tab.key)}
       >
-        <Text style={activeTab === tab.key ? styles.activeText : undefined}>
+        <Text style={activeTab !== tab.key ? styles.activeText : undefined}>
           {tab.label}
         </Text>

[Survived] BlockStatement
app/(tabs)/Profile.tsx:72:31
 const ListingsSection: React.FC<{
   activeTab: TabKey;
   tabs: TabConfig[];
-}> = ({ activeTab, tabs }) => {
-  const activeTabData = tabs.find((tab) => tab.key === activeTab);
-  return (
-    <View style={styles.listingsContainer}>
-      <Text style={styles.listings}>
-        {activeTabData?.label} ({activeTabData?.count})
-      </Text>
-      <TouchableOpacity>
-        <Ionicons name="filter" size={24} color="#007bff" />
-      </TouchableOpacity>
-    </View>
-  );
-};
+}> = ({ activeTab, tabs }) => {};
 
 const Profile: React.FC = () => {

[Survived] ArrowFunction
app/(tabs)/Profile.tsx:73:35
   activeTab: TabKey;
   tabs: TabConfig[];
 }> = ({ activeTab, tabs }) => {
-  const activeTabData = tabs.find((tab) => tab.key === activeTab);
+  const activeTabData = tabs.find(() => undefined);
   return (
     <View style={styles.listingsContainer}>

[Survived] EqualityOperator
app/(tabs)/Profile.tsx:73:44
   activeTab: TabKey;
   tabs: TabConfig[];
 }> = ({ activeTab, tabs }) => {
-  const activeTabData = tabs.find((tab) => tab.key === activeTab);
+  const activeTabData = tabs.find((tab) => tab.key !== activeTab);
   return (
     <View style={styles.listingsContainer}>

[Survived] OptionalChaining
app/(tabs)/Profile.tsx:77:10
   return (
     <View style={styles.listingsContainer}>
       <Text style={styles.listings}>
-        {activeTabData?.label} ({activeTabData?.count})
+        {activeTabData.label} ({activeTabData?.count})
       </Text>
       <TouchableOpacity>

[Survived] OptionalChaining
app/(tabs)/Profile.tsx:77:34
   return (
     <View style={styles.listingsContainer}>
       <Text style={styles.listings}>
-        {activeTabData?.label} ({activeTabData?.count})
+        {activeTabData?.label} ({activeTabData.count})
       </Text>
       <TouchableOpacity>

[Survived] StringLiteral
app/(tabs)/Profile.tsx:101:32
 
   // All tab-related configuration is defined here. Adding a new tab would only require extending this array.
   const tabs: TabConfig[] = [
-    { key: 'favorites', label: 'Favorites', count: profile.favorites },
+    { key: 'favorites', label: "", count: profile.favorites },
     { key: 'selling', label: 'Selling', count: profile.listings },
   ];

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:101:5
 
   // All tab-related configuration is defined here. Adding a new tab would only require extending this array.
   const tabs: TabConfig[] = [
-    { key: 'favorites', label: 'Favorites', count: profile.favorites },
+    {},
     { key: 'selling', label: 'Selling', count: profile.listings },
   ];

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:102:5
   // All tab-related configuration is defined here. Adding a new tab would only require extending this array.
   const tabs: TabConfig[] = [
     { key: 'favorites', label: 'Favorites', count: profile.favorites },
-    { key: 'selling', label: 'Selling', count: profile.listings },
+    {},
   ];
 

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:107:5
 
   const stats: ProfileStatsItem[] = [
     { label: 'Followers', value: profile.followers },
-    { label: 'Following', value: profile.following },
+    {},
     { label: 'Reviews', value: profile.reviews },
   ];

[Survived] StringLiteral
app/(tabs)/Profile.tsx:107:14
 
   const stats: ProfileStatsItem[] = [
     { label: 'Followers', value: profile.followers },
-    { label: 'Following', value: profile.following },
+    { label: "", value: profile.following },
     { label: 'Reviews', value: profile.reviews },
   ];

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:138:18
     fontSize: 20,
     fontWeight: 'bold',
   },
-  headerButtons: {
-    flexDirection: 'row',
-    gap: 15,
-  },
+  headerButtons: {},
   toggleButtons: {
     flexDirection: 'row',

[Survived] StringLiteral
app/(tabs)/Profile.tsx:143:20
     gap: 15,
   },
   toggleButtons: {
-    flexDirection: 'row',
+    flexDirection: "",
     justifyContent: 'center',
     gap: 20,

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:148:17
     gap: 20,
     marginBottom: 20,
   },
-  toggleButton: {
-    paddingVertical: 8,
-    paddingHorizontal: 20,
-    borderRadius: 20,
-    backgroundColor: '#f0f0f0',
-  },
+  toggleButton: {},
   activeButton: {
     backgroundColor: '#007bff',

[Survived] StringLiteral
app/(tabs)/Profile.tsx:159:17
   },
   activeText: {
     color: '#fff',
-    fontWeight: 'bold',
+    fontWeight: "",
   },
   profileInfo: {

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:175:10
     backgroundColor: '#eee',
     marginRight: 20,
   },
-  stats: {
-    flexDirection: 'row',
-    gap: 30,
-    marginLeft: 20,
-  },
+  stats: {},
   statItem: {
     alignItems: 'center',

[Survived] StringLiteral
app/(tabs)/Profile.tsx:176:20
     marginRight: 20,
   },
   stats: {
-    flexDirection: 'row',
+    flexDirection: "",
     gap: 30,
     marginLeft: 20,

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:180:13
     gap: 30,
     marginLeft: 20,
   },
-  statItem: {
-    alignItems: 'center',
-  },
+  statItem: {},
   statNumber: {
     fontSize: 20,

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:183:15
   statItem: {
     alignItems: 'center',
   },
-  statNumber: {
-    fontSize: 20,
-    fontWeight: 'bold',
-  },
+  statNumber: {},
   infoText: {
     fontSize: 14,

[Survived] StringLiteral
app/(tabs)/Profile.tsx:185:17
   },
   statNumber: {
     fontSize: 20,
-    fontWeight: 'bold',
+    fontWeight: "",
   },
   infoText: {

[Survived] StringLiteral
app/(tabs)/Profile.tsx:189:12
   },
   infoText: {
     fontSize: 14,
-    color: '#555',
+    color: "",
   },
   website: {

[Survived] StringLiteral
app/(tabs)/Profile.tsx:194:16
   website: {
     fontSize: 14,
     color: '#007bff',
-    textAlign: 'left',
+    textAlign: "",
     fontWeight: 'bold',
     marginBottom: 20,

[Survived] StringLiteral
app/(tabs)/Profile.tsx:195:17
     fontSize: 14,
     color: '#007bff',
     textAlign: 'left',
-    fontWeight: 'bold',
+    fontWeight: "",
     marginBottom: 20,
   },

[Survived] StringLiteral
app/(tabs)/Profile.tsx:201:17
   listingsContainer: {
     flexDirection: 'row',
     justifyContent: 'space-between',
-    alignItems: 'center',
+    alignItems: "",
   },
   listings: {

[Survived] ObjectLiteral
app/(tabs)/Profile.tsx:203:13
     justifyContent: 'space-between',
     alignItems: 'center',
   },
-  listings: {
-    fontSize: 16,
-    fontWeight: 'bold',
-  },
+  listings: {},
 });
 

[Survived] StringLiteral
app/(tabs)/Profile.tsx:205:17
   },
   listings: {
     fontSize: 16,
-    fontWeight: 'bold',
+    fontWeight: "",
   },
 });
