[Survived] BlockStatement
firebase/login.tsx:5:7
 import { auth } from "./firebase.config";
 
 export const login = async (email: string, password: string) => {
-  try {
-    const userCredential = await signInWithEmailAndPassword(
-      auth,
-      email,
-      password
-    );
-
-    if (!userCredential.user.emailVerified) {
-      return { error: "Please verify your email before logging in." };
-    }
-    
-    return { user: userCredential.user };
-  } catch (error: any) {
+  try {} catch (error: any) {
     let errorMessage = "An error occurred during login.";
 

[Survived] ConditionalExpression
firebase/login.tsx:12:9
       password
     );
 
-    if (!userCredential.user.emailVerified) {
+    if (false) {
       return { error: "Please verify your email before logging in." };
     }

[Survived] BlockStatement
firebase/login.tsx:12:45
       password
     );
 
-    if (!userCredential.user.emailVerified) {
-      return { error: "Please verify your email before logging in." };
-    }
+    if (!userCredential.user.emailVerified) {}
     
     return { user: userCredential.user };

[Survived] BlockStatement
firebase/login.tsx:17:24
     }
     
     return { user: userCredential.user };
-  } catch (error: any) {
-    let errorMessage = "An error occurred during login.";
-
-    switch (error.code) {
-      case "auth/invalid-email":
-        errorMessage = "Invalid email format.";
-        break;
-      case "auth/user-not-found":
-        errorMessage = "No account found with this email.";
-        break;
-      case "auth/wrong-password":
-        errorMessage = "Incorrect password. Please try again.";
-        break;
-      case "auth/user-disabled":
-        errorMessage = "This account has been disabled.";
-        break;
-    }
-
-    return { error: errorMessage };
-  }
+  } catch (error: any) {}
 };
 

[Survived] ConditionalExpression
firebase/login.tsx:21:7
     let errorMessage = "An error occurred during login.";
 
     switch (error.code) {
-      case "auth/invalid-email":
-        errorMessage = "Invalid email format.";
-        break;
+      case "auth/invalid-email":
       case "auth/user-not-found":
         errorMessage = "No account found with this email.";

[Survived] StringLiteral
firebase/login.tsx:21:12
     let errorMessage = "An error occurred during login.";
 
     switch (error.code) {
-      case "auth/invalid-email":
+      case "":
         errorMessage = "Invalid email format.";
         break;

[Survived] StringLiteral
firebase/login.tsx:22:24
 
     switch (error.code) {
       case "auth/invalid-email":
-        errorMessage = "Invalid email format.";
+        errorMessage = "";
         break;
       case "auth/user-not-found":

[Survived] ConditionalExpression
firebase/login.tsx:24:7
       case "auth/invalid-email":
         errorMessage = "Invalid email format.";
         break;
-      case "auth/user-not-found":
-        errorMessage = "No account found with this email.";
-        break;
+      case "auth/user-not-found":
       case "auth/wrong-password":
         errorMessage = "Incorrect password. Please try again.";

[Survived] ConditionalExpression
firebase/login.tsx:27:7
       case "auth/user-not-found":
         errorMessage = "No account found with this email.";
         break;
-      case "auth/wrong-password":
-        errorMessage = "Incorrect password. Please try again.";
-        break;
+      case "auth/wrong-password":
       case "auth/user-disabled":
         errorMessage = "This account has been disabled.";

[Survived] StringLiteral
firebase/login.tsx:27:12
       case "auth/user-not-found":
         errorMessage = "No account found with this email.";
         break;
-      case "auth/wrong-password":
+      case "":
         errorMessage = "Incorrect password. Please try again.";
         break;

[Survived] ConditionalExpression
firebase/login.tsx:30:7
       case "auth/wrong-password":
         errorMessage = "Incorrect password. Please try again.";
         break;
-      case "auth/user-disabled":
-        errorMessage = "This account has been disabled.";
-        break;
+      case "auth/user-disabled":
     }
 

[Survived] ObjectLiteral
firebase/login.tsx:35:12
         break;
     }
 
-    return { error: errorMessage };
+    return {};
   }
 };
