[Survived] ObjectLiteral
app/(tabs)/settings.tsx:11:18
   const navigation = useNavigation();
 
   return (
-    <View style={{ flex: 1, backgroundColor: '#F6F9FF' }}>
+    <View style={{}}>
       {/* Settings list */}
       <View style={styles.container}>

[Survived] ArrowFunction
app/(tabs)/settings.tsx:31:38
             <FontAwesome name="chevron-right" size={18} color="black" style={styles.tileIcon} />
           </TouchableOpacity>
 
-          <TouchableOpacity onPress={() => router.push('/settings')}></TouchableOpacity>
+          <TouchableOpacity onPress={() => undefined}></TouchableOpacity>
           <TouchableOpacity
             style={styles.settingItem}

[Survived] ArrowFunction
app/(tabs)/settings.tsx:34:22
           <TouchableOpacity onPress={() => router.push('/settings')}></TouchableOpacity>
           <TouchableOpacity
             style={styles.settingItem}
-            onPress={() => router.push('/(tabs)/interestsandsizes')} // cast to 'never' if TS complains
+            onPress={() => undefined} // cast to 'never' if TS complains
           >
             <Text style={styles.settingText}>Interest and Sizes</Text>

[Survived] StringLiteral
app/(tabs)/settings.tsx:62:84
           {/* Logout button */}
           <View style={styles.logoutContainer}>
             <TouchableOpacity style={styles.logoutButton} onPress={() => {/* handle logout */}}>
-            <FontAwesome name="sign-out" size={18} color="white" style={{position: 'absolute', left: 22, bottom: 12}} />
+            <FontAwesome name="sign-out" size={18} color="white" style={{position: "", left: 22, bottom: 12}} />
               <Text style={styles.logoutText}>Logout</Text>
             </TouchableOpacity>

[Survived] StringLiteral
app/(tabs)/settings.tsx:78:15
     paddingBottom: 80,
   },
   tileIcon: {
-    position: 'absolute',
+    position: "",
     right: 16,
     marginTop: 16,

[Survived] UnaryOperator
app/(tabs)/settings.tsx:90:19
     fontSize: 24,
     color: '#000',
     fontWeight: 'bold',
-    marginBottom: -10,
+    marginBottom: +10,
   },
   settingsList: {

[Survived] ObjectLiteral
app/(tabs)/settings.tsx:92:17
     fontWeight: 'bold',
     marginBottom: -10,
   },
-  settingsList: {
-    paddingHorizontal: 16,
-    paddingVertical: 2,
-  },
+  settingsList: {},
   settingItem: {
     paddingVertical: 16,

[Survived] ObjectLiteral
app/(tabs)/settings.tsx:101:16
     borderBottomWidth: 1,
     borderBottomColor: '#ccc',
   },
-  settingText: {
-    fontSize: 18,
-    color: '#000',
-  },
+  settingText: {},
   linkText: {
     fontSize: 14,

[Survived] StringLiteral
app/(tabs)/settings.tsx:103:12
   },
   settingText: {
     fontSize: 18,
-    color: '#000',
+    color: "",
   },
   linkText: {

[Survived] StringLiteral
app/(tabs)/settings.tsx:115:22
     alignItems: 'center',
   },
   logoutButton: {
-    backgroundColor: '#000',
+    backgroundColor: "",
     paddingHorizontal: 24,
     paddingVertical: 12,
