[Survived] StringLiteral
app/(tabs)/signup.tsx:17:15
 
 const firebaseConfig = {
   apiKey: "AIzaSyD7EBLPezmrBujRy58eLzmAV1jeKTUrPoQ",
-  authDomain: "thriftuni-b345a.firebaseapp.com",
+  authDomain: "",
   projectId: "thriftuni-b345a",
   storageBucket: "thriftuni-b345a.firebasestorage.app",

[Survived] StringLiteral
app/(tabs)/signup.tsx:18:14
 const firebaseConfig = {
   apiKey: "AIzaSyD7EBLPezmrBujRy58eLzmAV1jeKTUrPoQ",
   authDomain: "thriftuni-b345a.firebaseapp.com",
-  projectId: "thriftuni-b345a",
+  projectId: "",
   storageBucket: "thriftuni-b345a.firebasestorage.app",
   messagingSenderId: "501062585933",

[Survived] StringLiteral
app/(tabs)/signup.tsx:19:18
   apiKey: "AIzaSyD7EBLPezmrBujRy58eLzmAV1jeKTUrPoQ",
   authDomain: "thriftuni-b345a.firebaseapp.com",
   projectId: "thriftuni-b345a",
-  storageBucket: "thriftuni-b345a.firebasestorage.app",
+  storageBucket: "",
   messagingSenderId: "501062585933",
   appId: "1:501062585933:web:7bb28a9b3f4f2f61a3d604",

[Survived] StringLiteral
app/(tabs)/signup.tsx:22:18
   storageBucket: "thriftuni-b345a.firebasestorage.app",
   messagingSenderId: "501062585933",
   appId: "1:501062585933:web:7bb28a9b3f4f2f61a3d604",
-  measurementId: "G-MCWKZZQPTP",
+  measurementId: "",
 };
 

[Survived] BooleanLiteral
app/(tabs)/signup.tsx:25:13
   measurementId: "G-MCWKZZQPTP",
 };
 
-const app = !getApps().length ? initializeApp(firebaseConfig) : getApp();
+const app = getApps().length ? initializeApp(firebaseConfig) : getApp();
 
 const auth = getAuth(app);

[Survived] StringLiteral
app/(tabs)/signup.tsx:33:38
 export default function Signup() {
   const [name, setName] = useState("");
   const [username, setUsername] = useState("");
-  const [email, setEmail] = useState("");
+  const [email, setEmail] = useState("Stryker was here!");
   const [password, setPassword] = useState("");
   const [verificationSent, setVerificationSent] = useState(false);

[Survived] BooleanLiteral
app/(tabs)/signup.tsx:35:60
   const [username, setUsername] = useState("");
   const [email, setEmail] = useState("");
   const [password, setPassword] = useState("");
-  const [verificationSent, setVerificationSent] = useState(false);
+  const [verificationSent, setVerificationSent] = useState(true);
 
   const handleSignup = async () => {

[Survived] BooleanLiteral
app/(tabs)/signup.tsx:38:41
   const [verificationSent, setVerificationSent] = useState(false);
 
   const handleSignup = async () => {
-    if (!email || !password || !name || !username) {
+    if (!email || !password || !name || username) {
       Alert.alert("Error", "Please fill all fields");
       return;

[Survived] LogicalOperator
app/(tabs)/signup.tsx:38:9
   const [verificationSent, setVerificationSent] = useState(false);
 
   const handleSignup = async () => {
-    if (!email || !password || !name || !username) {
+    if ((!email || !password) && !name || !username) {
       Alert.alert("Error", "Please fill all fields");
       return;

[Survived] StringLiteral
app/(tabs)/signup.tsx:39:28
 
   const handleSignup = async () => {
     if (!email || !password || !name || !username) {
-      Alert.alert("Error", "Please fill all fields");
+      Alert.alert("Error", "");
       return;
     }

[Survived] BlockStatement
app/(tabs)/signup.tsx:43:9
       return;
     }
 
-    try {
-      const userCredential = await createUserWithEmailAndPassword(
-        auth,
-        email,
-        password
-      );
-      const user = userCredential.user;
-
-      await auth.currentUser?.reload();
-
-      await sendEmailVerification(auth.currentUser);
-      setVerificationSent(true);
-
-      await setDoc(doc(db, "users", user.uid), {
-        name,
-        username,
-        email,
-        createdAt: new Date(),
-      });
-
-      Alert.alert("Success", "Sign-up successful! Please check your email for verification.");
-    } catch (error) {
+    try {} catch (error) {
       Alert.alert("Error", (error as any).message);
     }

[Survived] OptionalChaining
app/(tabs)/signup.tsx:51:13
       );
       const user = userCredential.user;
 
-      await auth.currentUser?.reload();
+      await auth.currentUser.reload();
 
       await sendEmailVerification(auth.currentUser);

[Survived] BooleanLiteral
app/(tabs)/signup.tsx:54:27
       await auth.currentUser?.reload();
 
       await sendEmailVerification(auth.currentUser);
-      setVerificationSent(true);
+      setVerificationSent(false);
 
       await setDoc(doc(db, "users", user.uid), {

[Survived] StringLiteral
app/(tabs)/signup.tsx:63:30
         createdAt: new Date(),
       });
 
-      Alert.alert("Success", "Sign-up successful! Please check your email for verification.");
+      Alert.alert("Success", "");
     } catch (error) {
       Alert.alert("Error", (error as any).message);

[Survived] StringLiteral
app/(tabs)/signup.tsx:63:19
         createdAt: new Date(),
       });
 
-      Alert.alert("Success", "Sign-up successful! Please check your email for verification.");
+      Alert.alert("", "Sign-up successful! Please check your email for verification.");
     } catch (error) {
       Alert.alert("Error", (error as any).message);

[Survived] BlockStatement
app/(tabs)/signup.tsx:64:21
       });
 
       Alert.alert("Success", "Sign-up successful! Please check your email for verification.");
-    } catch (error) {
-      Alert.alert("Error", (error as any).message);
-    }
+    } catch (error) {}
   };
 

[Survived] BlockStatement
app/(tabs)/signup.tsx:69:29
     }
   };
 
-  const handleLogin = () => {
-    router.push("/login/login");
-  };
+  const handleLogin = () => {};
 
   const resendVerificationEmail = async () => {

[Survived] StringLiteral
app/(tabs)/signup.tsx:70:17
   };
 
   const handleLogin = () => {
-    router.push("/login/login");
+    router.push("");
   };
 

[Survived] BlockStatement
app/(tabs)/signup.tsx:73:47
     router.push("/login/login");
   };
 
-  const resendVerificationEmail = async () => {
-    if (auth.currentUser) {
-      try {
-        await sendEmailVerification(auth.currentUser);
-        Alert.alert("Success", "Verification email sent. Please check your inbox.");
-      } catch (error: any) {
-        Alert.alert("Error", "Failed to send verification email.");
-      }
-    }
-  };
+  const resendVerificationEmail = async () => {};
 
   return (

[Survived] ConditionalExpression
app/(tabs)/signup.tsx:74:9
   };
 
   const resendVerificationEmail = async () => {
-    if (auth.currentUser) {
+    if (true) {
       try {
         await sendEmailVerification(auth.currentUser);

[Survived] ConditionalExpression
app/(tabs)/signup.tsx:74:9
   };
 
   const resendVerificationEmail = async () => {
-    if (auth.currentUser) {
+    if (false) {
       try {
         await sendEmailVerification(auth.currentUser);

[Survived] BlockStatement
app/(tabs)/signup.tsx:75:11
 
   const resendVerificationEmail = async () => {
     if (auth.currentUser) {
-      try {
-        await sendEmailVerification(auth.currentUser);
-        Alert.alert("Success", "Verification email sent. Please check your inbox.");
-      } catch (error: any) {
+      try {} catch (error: any) {
         Alert.alert("Error", "Failed to send verification email.");
       }

[Survived] StringLiteral
app/(tabs)/signup.tsx:77:32
     if (auth.currentUser) {
       try {
         await sendEmailVerification(auth.currentUser);
-        Alert.alert("Success", "Verification email sent. Please check your inbox.");
+        Alert.alert("Success", "");
       } catch (error: any) {
         Alert.alert("Error", "Failed to send verification email.");

[Survived] StringLiteral
app/(tabs)/signup.tsx:77:21
     if (auth.currentUser) {
       try {
         await sendEmailVerification(auth.currentUser);
-        Alert.alert("Success", "Verification email sent. Please check your inbox.");
+        Alert.alert("", "Verification email sent. Please check your inbox.");
       } catch (error: any) {
         Alert.alert("Error", "Failed to send verification email.");

[Survived] BlockStatement
app/(tabs)/signup.tsx:78:28
       try {
         await sendEmailVerification(auth.currentUser);
         Alert.alert("Success", "Verification email sent. Please check your inbox.");
-      } catch (error: any) {
-        Alert.alert("Error", "Failed to send verification email.");
-      }
+      } catch (error: any) {}
     }
   };

[Survived] StringLiteral
app/(tabs)/signup.tsx:79:30
         await sendEmailVerification(auth.currentUser);
         Alert.alert("Success", "Verification email sent. Please check your inbox.");
       } catch (error: any) {
-        Alert.alert("Error", "Failed to send verification email.");
+        Alert.alert("Error", "");
       }
     }

[Survived] ConditionalExpression
app/(tabs)/signup.tsx:120:8
         </TouchableOpacity>
       </View>
 
-      {verificationSent && (
-        <View style={styles.resendContainer}>
-          <Text style={styles.resendText}>
-            A verification email has been sent. If you didn’t receive it, you can request another one.
-          </Text>
-          <TouchableOpacity style={styles.resendButton} onPress={resendVerificationEmail}>
-            <Text style={styles.resendButtonText}>Resend Verification Email</Text>
-          </TouchableOpacity>
-        </View>
-      )}
+      {false}
       
       <Text style={styles.loginText}>

[Survived] ConditionalExpression
app/(tabs)/signup.tsx:120:8
         </TouchableOpacity>
       </View>
 
-      {verificationSent && (
-        <View style={styles.resendContainer}>
-          <Text style={styles.resendText}>
-            A verification email has been sent. If you didn’t receive it, you can request another one.
-          </Text>
-          <TouchableOpacity style={styles.resendButton} onPress={resendVerificationEmail}>
-            <Text style={styles.resendButtonText}>Resend Verification Email</Text>
-          </TouchableOpacity>
-        </View>
-      )}
+      {true}
       
       <Text style={styles.loginText}>

[Survived] StringLiteral
app/(tabs)/signup.tsx:144:22
 const styles = StyleSheet.create({
   container: {
     flex: 1,
-    backgroundColor: "#F6F9FF",
+    backgroundColor: "",
     justifyContent: "center",
     alignItems: "center",

[Survived] StringLiteral
app/(tabs)/signup.tsx:153:17
     fontSize: 32,
     fontWeight: "bold",
     marginBottom: 20,
-    fontFamily: "Calibri",
+    fontFamily: "",
   },
   form: {

[Survived] ObjectLiteral
app/(tabs)/signup.tsx:155:9
     marginBottom: 20,
     fontFamily: "Calibri",
   },
-  form: {
-    width: "100%",
-    maxWidth: 400,
-  },
+  form: {},
   input: {
     width: "100%",

[Survived] StringLiteral
app/(tabs)/signup.tsx:167:17
     borderColor: "black",
     borderRadius: 15,
     backgroundColor: "#F6F9FF",
-    fontFamily: "Calibri",
+    fontFamily: "",
   },
   button: {

[Survived] StringLiteral
app/(tabs)/signup.tsx:170:22
     fontFamily: "Calibri",
   },
   button: {
-    backgroundColor: "#F45D5D",
+    backgroundColor: "",
     padding: 12,
     borderRadius: 15,

[Survived] StringLiteral
app/(tabs)/signup.tsx:177:12
     marginTop: 10,
   },
   buttonText: {
-    color: "#fff",
+    color: "",
     fontSize: 20,
     fontWeight: "bold",

[Survived] StringLiteral
app/(tabs)/signup.tsx:185:12
     marginTop: 20,
   },
   link: {
-    color: "blue",
+    color: "",
     textDecorationLine: "underline",
   },
