[Survived] BlockStatement
app/(tabs)/_layout.tsx:19:4
 function TabBarIcon(props: {
   name: React.ComponentProps<typeof FontAwesome>['name'];
   color: string;
-}) {
-  return <FontAwesome size={28} style={{ marginBottom: -3 }} {...props} />;
-}
+}) {}
 
 export default function TabLayout() {

[Survived] UnaryOperator
app/(tabs)/_layout.tsx:20:56
   name: React.ComponentProps<typeof FontAwesome>['name'];
   color: string;
 }) {
-  return <FontAwesome size={28} style={{ marginBottom: -3 }} {...props} />;
+  return <FontAwesome size={28} style={{ marginBottom: +3 }} {...props} />;
 }
 

[Survived] ObjectLiteral
app/(tabs)/_layout.tsx:31:24
       {/* Commented as we don't need this anymore Example code for Document creation*/}
       {/* <CreateFirestoreCollections /> */}
       <Tabs
-        screenOptions={{
-          tabBarActiveTintColor: Colors[colorScheme ?? 'light'].tint,
-          // Disable the static render of the header on web
-          // to prevent a hydration error in React Navigation v6.
-          headerShown: useClientOnlyValue(false, true),
-        }}>
+        screenOptions={{}}>
         <Tabs.Screen
           name="index"

[Survived] LogicalOperator
app/(tabs)/_layout.tsx:32:41
       {/* <CreateFirestoreCollections /> */}
       <Tabs
         screenOptions={{
-          tabBarActiveTintColor: Colors[colorScheme ?? 'light'].tint,
+          tabBarActiveTintColor: Colors[colorScheme && 'light'].tint,
           // Disable the static render of the header on web
           // to prevent a hydration error in React Navigation v6.

[Survived] BooleanLiteral
app/(tabs)/_layout.tsx:35:50
           tabBarActiveTintColor: Colors[colorScheme ?? 'light'].tint,
           // Disable the static render of the header on web
           // to prevent a hydration error in React Navigation v6.
-          headerShown: useClientOnlyValue(false, true),
+          headerShown: useClientOnlyValue(false, false),
         }}>
         <Tabs.Screen

[Survived] BooleanLiteral
app/(tabs)/_layout.tsx:35:43
           tabBarActiveTintColor: Colors[colorScheme ?? 'light'].tint,
           // Disable the static render of the header on web
           // to prevent a hydration error in React Navigation v6.
-          headerShown: useClientOnlyValue(false, true),
+          headerShown: useClientOnlyValue(true, true),
         }}>
         <Tabs.Screen

[Survived] ObjectLiteral
app/(tabs)/_layout.tsx:39:20
         }}>
         <Tabs.Screen
           name="index"
-          options={{
-            title: 'Browse',
-            tabBarIcon: ({ color }) => <TabBarIcon name="search" color={color} />,
-          }}
+          options={{}}
         />
         <Tabs.Screen

[Survived] StringLiteral
app/(tabs)/_layout.tsx:40:20
         <Tabs.Screen
           name="index"
           options={{
-            title: 'Browse',
+            title: "",
             tabBarIcon: ({ color }) => <TabBarIcon name="search" color={color} />,
           }}

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:41:25
           name="index"
           options={{
             title: 'Browse',
-            tabBarIcon: ({ color }) => <TabBarIcon name="search" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />

[Survived] ObjectLiteral
app/(tabs)/_layout.tsx:46:20
         />
         <Tabs.Screen
           name="ListItem"
-          options={{
-            title: 'List an item',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
-          }}
+          options={{}}
         />
         <Tabs.Screen

[Survived] StringLiteral
app/(tabs)/_layout.tsx:47:20
         <Tabs.Screen
           name="ListItem"
           options={{
-            title: 'List an item',
+            title: "",
             tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
           }}

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:48:25
           name="ListItem"
           options={{
             title: 'List an item',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:55:25
           name="settings"
           options={{
             title: 'Settings',
-            tabBarIcon: ({ color }) => <TabBarIcon name="gear" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:62:25
           name="profile"
           options={{
             title: 'Profile',
-            tabBarIcon: ({ color }) => <TabBarIcon name="user" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />

[Survived] ObjectLiteral
app/(tabs)/_layout.tsx:67:20
         />
         <Tabs.Screen
           name="my_listings"
-          options={{
-            title: 'My Listing',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
-          }}
+          options={{}}
         />
         <Tabs.Screen

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:69:25
           name="my_listings"
           options={{
             title: 'My Listing',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />

[Survived] ObjectLiteral
app/(tabs)/_layout.tsx:74:20
         />
         <Tabs.Screen
           name="WishlistPage"
-          options={{
-            title: 'Wishlist',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
-          }}
+          options={{}}
         />
       </Tabs>

[Survived] StringLiteral
app/(tabs)/_layout.tsx:75:20
         <Tabs.Screen
           name="WishlistPage"
           options={{
-            title: 'Wishlist',
+            title: "",
             tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
           }}

[Survived] ArrowFunction
app/(tabs)/_layout.tsx:76:25
           name="WishlistPage"
           options={{
             title: 'Wishlist',
-            tabBarIcon: ({ color }) => <TabBarIcon name="code" color={color} />,
+            tabBarIcon: () => undefined,
           }}
         />
