[Survived] BlockStatement
app/+not-found.tsx:6:42
 
 import { Text, View } from '@/components/Themed';
 
-export default function NotFoundScreen() {
-  return (
-    <>
-      <Stack.Screen options={{ title: 'Oops!' }} />
-      <View style={styles.container}>
-        <Text style={styles.title}>This screen doesn't exist.</Text>
-
-        <Link href="/(tabs)/index" style={styles.link}>
-          <Text style={styles.linkText}>Go to home screen!</Text>
-        </Link>
-      </View>
-    </>
-  );
-}
+export default function NotFoundScreen() {}
 
 const styles = StyleSheet.create({

[Survived] ObjectLiteral
app/+not-found.tsx:9:30
 export default function NotFoundScreen() {
   return (
     <>
-      <Stack.Screen options={{ title: 'Oops!' }} />
+      <Stack.Screen options={{}} />
       <View style={styles.container}>
         <Text style={styles.title}>This screen doesn't exist.</Text>

[Survived] ObjectLiteral
app/+not-found.tsx:28:10
     justifyContent: 'center',
     padding: 20,
   },
-  title: {
-    fontSize: 20,
-    fontWeight: 'bold',
-  },
+  title: {},
   link: {
     marginTop: 15,

[Survived] ObjectLiteral
app/+not-found.tsx:32:9
     fontSize: 20,
     fontWeight: 'bold',
   },
-  link: {
-    marginTop: 15,
-    paddingVertical: 15,
-  },
+  link: {},
   linkText: {
     fontSize: 14,

[Survived] StringLiteral
app/+not-found.tsx:38:12
   },
   linkText: {
     fontSize: 14,
-    color: '#2e78b7',
+    color: "",
   },
 });
