[Survived] BlockStatement
app/listings/[id].tsx:9:45
 } from "@/components/DisplayIndividualListing";
 import { Listings } from "../(tabs)";
 
-export default function IndividualListing() {
-  const { id } = useLocalSearchParams();
-
-  const product: Listings = dummyData.find((item) => item.id.toString() === id);
-
-  if (!product)
-    return (
-      <Text style={{ color: "white" }}>
-        Product not found ${dummyData.length} id = ${id}
-      </Text>
-    );
-
-  const listingDetails: ListingDetails = {
-    title: product.title,
-    pictures: product.pictures,
-    description: product.description,
-    sellerDetails: product.sellerInfo,
-    longitude: product.longitude,
-    latitude: product.latitude,
-  };
-
-  return <DisplayIndividualListing {...listingDetails} />;
-}
+export default function IndividualListing() {}
 

[Survived] EqualityOperator
app/listings/[id].tsx:12:54
 export default function IndividualListing() {
   const { id } = useLocalSearchParams();
 
-  const product: Listings = dummyData.find((item) => item.id.toString() === id);
+  const product: Listings = dummyData.find((item) => item.id.toString() !== id);
 
   if (!product)

[Survived] ArrowFunction
app/listings/[id].tsx:12:44
 export default function IndividualListing() {
   const { id } = useLocalSearchParams();
 
-  const product: Listings = dummyData.find((item) => item.id.toString() === id);
+  const product: Listings = dummyData.find(() => undefined);
 
   if (!product)

[Survived] ConditionalExpression
app/listings/[id].tsx:14:7
 
   const product: Listings = dummyData.find((item) => item.id.toString() === id);
 
-  if (!product)
+  if (false)
     return (
       <Text style={{ color: "white" }}>

[Survived] BooleanLiteral
app/listings/[id].tsx:14:7
 
   const product: Listings = dummyData.find((item) => item.id.toString() === id);
 
-  if (!product)
+  if (product)
     return (
       <Text style={{ color: "white" }}>

[Survived] ObjectLiteral
app/listings/[id].tsx:16:20
 
   if (!product)
     return (
-      <Text style={{ color: "white" }}>
+      <Text style={{}}>
         Product not found ${dummyData.length} id = ${id}
       </Text>
