[Survived] ObjectLiteral
app/_layout.tsx:20:34
   ErrorBoundary,
 } from "expo-router";
 
-export const unstable_settings = {
-  // Ensure that reloading on `/modal` keeps a back button present.
-  initialRouteName: "(tabs)",
-};
+export const unstable_settings = {};
 
 // Prevent the splash screen from auto-hiding before asset loading is complete.

[Survived] BlockStatement
app/_layout.tsx:28:38
 // Prevent the splash screen from auto-hiding before asset loading is complete.
 SplashScreen.preventAutoHideAsync();
 
-export default function RootLayout() {
-  const [loaded, error] = useFonts({
-    SpaceMono: require("../assets/fonts/SpaceMono-Regular.ttf"),
-    ...FontAwesome.font,
-  });
-
-  // Expo Router uses Error Boundaries to catch errors in the navigation tree.
-  useEffect(() => {
-    if (error) throw error;
-  }, [error]);
-
-  useEffect(() => {
-    if (loaded) {
-      SplashScreen.hideAsync();
-    }
-  }, [loaded]);
-
-  if (!loaded) {
-    return null;
-  }
-
-  return <RootLayoutNav />;
-}
+export default function RootLayout() {}
 
 function RootLayoutNav() {

[Survived] ObjectLiteral
app/_layout.tsx:29:36
 SplashScreen.preventAutoHideAsync();
 
 export default function RootLayout() {
-  const [loaded, error] = useFonts({
-    SpaceMono: require("../assets/fonts/SpaceMono-Regular.ttf"),
-    ...FontAwesome.font,
-  });
+  const [loaded, error] = useFonts({});
 
   // Expo Router uses Error Boundaries to catch errors in the navigation tree.

[Survived] BlockStatement
app/_layout.tsx:35:19
   });
 
   // Expo Router uses Error Boundaries to catch errors in the navigation tree.
-  useEffect(() => {
-    if (error) throw error;
-  }, [error]);
+  useEffect(() => {}, [error]);
 
   useEffect(() => {

[Survived] ConditionalExpression
app/_layout.tsx:36:9
 
   // Expo Router uses Error Boundaries to catch errors in the navigation tree.
   useEffect(() => {
-    if (error) throw error;
+    if (false) throw error;
   }, [error]);
 

[Survived] ConditionalExpression
app/_layout.tsx:36:9
 
   // Expo Router uses Error Boundaries to catch errors in the navigation tree.
   useEffect(() => {
-    if (error) throw error;
+    if (true) throw error;
   }, [error]);
 

[Survived] BlockStatement
app/_layout.tsx:39:19
     if (error) throw error;
   }, [error]);
 
-  useEffect(() => {
-    if (loaded) {
-      SplashScreen.hideAsync();
-    }
-  }, [loaded]);
+  useEffect(() => {}, [loaded]);
 
   if (!loaded) {

[Survived] BlockStatement
app/_layout.tsx:40:17
   }, [error]);
 
   useEffect(() => {
-    if (loaded) {
-      SplashScreen.hideAsync();
-    }
+    if (loaded) {}
   }, [loaded]);
 

[Survived] ConditionalExpression
app/_layout.tsx:40:9
   }, [error]);
 
   useEffect(() => {
-    if (loaded) {
+    if (true) {
       SplashScreen.hideAsync();
     }

[Survived] ArrayDeclaration
app/_layout.tsx:43:6
     if (loaded) {
       SplashScreen.hideAsync();
     }
-  }, [loaded]);
+  }, []);
 
   if (!loaded) {

[Survived] BlockStatement
app/_layout.tsx:45:16
     }
   }, [loaded]);
 
-  if (!loaded) {
-    return null;
-  }
+  if (!loaded) {}
 
   return <RootLayoutNav />;

[Survived] ConditionalExpression
app/_layout.tsx:45:7
     }
   }, [loaded]);
 
-  if (!loaded) {
+  if (true) {
     return null;
   }

[Survived] BlockStatement
app/_layout.tsx:52:26
   return <RootLayoutNav />;
 }
 
-function RootLayoutNav() {
-  const colorScheme = useColorScheme();
-
-  return (
-    <ThemeProvider value={colorScheme === "dark" ? DarkTheme : DefaultTheme}>
-      <Stack>
-        <Stack.Screen name="(tabs)" options={{ headerShown: false }} />
-        <Stack.Screen name="modal" options={{ presentation: "modal" }} />
-        <Stack.Screen
-          name="listings/[id]"
-          options={{ headerBackTitle: "Back" }}
-        />
-      </Stack>
-    </ThemeProvider>
-  );
-}
+function RootLayoutNav() {}
 

[Survived] ConditionalExpression
app/_layout.tsx:56:27
   const colorScheme = useColorScheme();
 
   return (
-    <ThemeProvider value={colorScheme === "dark" ? DarkTheme : DefaultTheme}>
+    <ThemeProvider value={true ? DarkTheme : DefaultTheme}>
       <Stack>
         <Stack.Screen name="(tabs)" options={{ headerShown: false }} />

[Survived] ConditionalExpression
app/_layout.tsx:56:27
   const colorScheme = useColorScheme();
 
   return (
-    <ThemeProvider value={colorScheme === "dark" ? DarkTheme : DefaultTheme}>
+    <ThemeProvider value={false ? DarkTheme : DefaultTheme}>
       <Stack>
         <Stack.Screen name="(tabs)" options={{ headerShown: false }} />

[Survived] BooleanLiteral
app/_layout.tsx:58:61
   return (
     <ThemeProvider value={colorScheme === "dark" ? DarkTheme : DefaultTheme}>
       <Stack>
-        <Stack.Screen name="(tabs)" options={{ headerShown: false }} />
+        <Stack.Screen name="(tabs)" options={{ headerShown: true }} />
         <Stack.Screen name="modal" options={{ presentation: "modal" }} />
         <Stack.Screen

[Survived] ObjectLiteral
app/_layout.tsx:59:45
     <ThemeProvider value={colorScheme === "dark" ? DarkTheme : DefaultTheme}>
       <Stack>
         <Stack.Screen name="(tabs)" options={{ headerShown: false }} />
-        <Stack.Screen name="modal" options={{ presentation: "modal" }} />
+        <Stack.Screen name="modal" options={{}} />
         <Stack.Screen
           name="listings/[id]"
