[Survived] BlockStatement
components/Buttons/ContactSeller.tsx:4:75
 import { StyleSheet, ScrollView, Dimensions, TouchableOpacity} from 'react-native';
 import {View, Text} from '@/components/Themed';
 
-export default function ContactSeller({ onPress } : {onPress:() => void}) {
-    return (
-            <TouchableOpacity style={styles.button}>
-                <Text style={styles.text}>Contact seller</Text>
-            </TouchableOpacity>
-    )
-}
+export default function ContactSeller({ onPress } : {onPress:() => void}) {}
 
 const styles = StyleSheet.create({

[Survived] StringLiteral
components/Buttons/ContactSeller.tsx:15:21
 const styles = StyleSheet.create({
     button: {
         flexDirection: 'row', // Align icon & text
-        alignItems: 'center',
+        alignItems: "",
         backgroundColor: 'black',
         paddingVertical: 12,

[Survived] StringLiteral
components/Buttons/ContactSeller.tsx:16:26
     button: {
         flexDirection: 'row', // Align icon & text
         alignItems: 'center',
-        backgroundColor: 'black',
+        backgroundColor: "",
         paddingVertical: 12,
         paddingHorizontal: 20,

[Survived] StringLiteral
components/Buttons/ContactSeller.tsx:21:16
         paddingHorizontal: 20,
         borderRadius: 10,
         justifyContent: 'center',
-        width: '100%',
+        width: "",
         marginBottom: 10,
     },

[Survived] ObjectLiteral
components/Buttons/ContactSeller.tsx:24:11
         width: '100%',
         marginBottom: 10,
     },
-    text: {
-        color: 'white',
-        fontSize: 16,
-        fontWeight: '400',
-        fontStyle: 'italic',
-    },
+    text: {},
 });

[Survived] StringLiteral
components/Buttons/ContactSeller.tsx:27:21
     text: {
         color: 'white',
         fontSize: 16,
-        fontWeight: '400',
+        fontWeight: "",
         fontStyle: 'italic',
     },
