[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:38:23
                 sq_SI: require('../../assets/images/signin-assets/android/png@3x/neutral/android_neutral_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/android/png@3x/neutral/android_neutral_sq_SU.png'),
             },
-            'png@4x': {
-                rd_ctn: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/android/png@4x/neutral/android_neutral_sq_SU.png'),
-            },
+            'png@4x': {},
         },
         light: {

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:50:23
             },
         },
         light: {
-            'png@1x': {
-                rd_ctn: require('../../assets/images/signin-assets/android/png@1x/light/android_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/android/png@1x/light/android_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/android/png@1x/light/android_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/android/png@1x/light/android_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/android/png@1x/light/android_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/android/png@1x/light/android_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/android/png@1x/light/android_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/android/png@1x/light/android_light_sq_SU.png'),
-            },
+            'png@1x': {},
             'png@2x': {
                 rd_ctn: require('../../assets/images/signin-assets/android/png@2x/light/android_light_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:80:23
                 sq_SI: require('../../assets/images/signin-assets/android/png@3x/light/android_light_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/android/png@3x/light/android_light_sq_SU.png'),
             },
-            'png@4x': {
-                rd_ctn: require('../../assets/images/signin-assets/android/png@4x/light/android_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/android/png@4x/light/android_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/android/png@4x/light/android_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/android/png@4x/light/android_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/android/png@4x/light/android_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/android/png@4x/light/android_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/android/png@4x/light/android_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/android/png@4x/light/android_light_sq_SU.png'),
-            },
+            'png@4x': {},
         },
         dark: {

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:92:23
             },
         },
         dark: {
-            'png@1x': {
-                rd_ctn: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/android/png@1x/dark/android_dark_sq_SU.png'),
-            },
+            'png@1x': {},
             'png@2x': {
                 rd_ctn: require('../../assets/images/signin-assets/android/png@2x/dark/android_dark_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:156:23
                 sq_SI: require('../../assets/images/signin-assets/ios/png@2x/neutral/ios_neutral_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/ios/png@2x/neutral/ios_neutral_sq_SU.png'),
             },
-            'png@3x': {
-                rd_ctn: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_SU.png'),
-            },
+            'png@3x': {},
             'png@4x': {
                 rd_ctn: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:166:23
                 sq_SI: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/ios/png@3x/neutral/ios_neutral_sq_SU.png'),
             },
-            'png@4x': {
-                rd_ctn: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/ios/png@4x/neutral/ios_neutral_sq_SU.png'),
-            },
+            'png@4x': {},
         },
         light: {

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:178:23
             },
         },
         light: {
-            'png@1x': {
-                rd_ctn: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/ios/png@1x/light/ios_light_sq_SU.png'),
-            },
+            'png@1x': {},
             'png@2x': {
                 rd_ctn: require('../../assets/images/signin-assets/ios/png@2x/light/ios_light_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:198:23
                 sq_SI: require('../../assets/images/signin-assets/ios/png@2x/light/ios_light_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/ios/png@2x/light/ios_light_sq_SU.png'),
             },
-            'png@3x': {
-                rd_ctn: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/ios/png@3x/light/ios_light_sq_SU.png'),
-            },
+            'png@3x': {},
             'png@4x': {
                 rd_ctn: require('../../assets/images/signin-assets/ios/png@4x/light/ios_light_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:220:23
             },
         },
         dark: {
-            'png@1x': {
-                rd_ctn: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/ios/png@1x/dark/ios_dark_sq_SU.png'),
-            },
+            'png@1x': {},
             'png@2x': {
                 rd_ctn: require('../../assets/images/signin-assets/ios/png@2x/dark/ios_dark_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:316:23
                 sq_SI: require('../../assets/images/signin-assets/web/png@1x/light/web_light_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/web/png@1x/light/web_light_sq_SU.png'),
             },
-            'png@2x': {
-                rd_ctn: require('../../assets/images/signin-assets/web/png@2x/light/web_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/web/png@2x/light/web_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/web/png@2x/light/web_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/web/png@2x/light/web_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_SU.png'),
-            },
+            'png@2x': {},
             'png@3x': {
                 rd_ctn: require('../../assets/images/signin-assets/web/png@3x/light/web_light_rd_ctn.png'),

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:326:23
                 sq_SI: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_SI.png'),
                 sq_SU: require('../../assets/images/signin-assets/web/png@2x/light/web_light_sq_SU.png'),
             },
-            'png@3x': {
-                rd_ctn: require('../../assets/images/signin-assets/web/png@3x/light/web_light_rd_ctn.png'),
-                rd_na: require('../../assets/images/signin-assets/web/png@3x/light/web_light_rd_na.png'),
-                rd_SI: require('../../assets/images/signin-assets/web/png@3x/light/web_light_rd_SI.png'),
-                rd_SU: require('../../assets/images/signin-assets/web/png@3x/light/web_light_rd_SU.png'),
-                sq_ctn: require('../../assets/images/signin-assets/web/png@3x/light/web_light_sq_ctn.png'),
-                sq_na: require('../../assets/images/signin-assets/web/png@3x/light/web_light_sq_na.png'),
-                sq_SI: require('../../assets/images/signin-assets/web/png@3x/light/web_light_sq_SI.png'),
-                sq_SU: require('../../assets/images/signin-assets/web/png@3x/light/web_light_sq_SU.png'),
-            },
+            'png@3x': {},
             'png@4x': {
                 rd_ctn: require('../../assets/images/signin-assets/web/png@4x/light/web_light_rd_ctn.png'),

[Survived] BlockStatement
components/Buttons/GoogleButtons.tsx:393:26
 };
 
 // Función para seleccionar la densidad correcta
-const getDensity = () => {
-    const scale = PixelRatio.get();
-    if (scale >= 4) return 'png@4x';
-    if (scale >= 3) return 'png@3x';
-    if (scale >= 2) return 'png@2x';
-    return 'png@1x';
-};
+const getDensity = () => {};
 
 const GoogleButton = ({ theme = 'light', styleType = 'rd_ctn', onPress=() => console.log('Google Sign-In Pressed') }) => {

[Survived] ConditionalExpression
components/Buttons/GoogleButtons.tsx:395:9
 // Función para seleccionar la densidad correcta
 const getDensity = () => {
     const scale = PixelRatio.get();
-    if (scale >= 4) return 'png@4x';
+    if (true) return 'png@4x';
     if (scale >= 3) return 'png@3x';
     if (scale >= 2) return 'png@2x';

[Survived] EqualityOperator
components/Buttons/GoogleButtons.tsx:395:9
 // Función para seleccionar la densidad correcta
 const getDensity = () => {
     const scale = PixelRatio.get();
-    if (scale >= 4) return 'png@4x';
+    if (scale > 4) return 'png@4x';
     if (scale >= 3) return 'png@3x';
     if (scale >= 2) return 'png@2x';

[Survived] ConditionalExpression
components/Buttons/GoogleButtons.tsx:396:9
 const getDensity = () => {
     const scale = PixelRatio.get();
     if (scale >= 4) return 'png@4x';
-    if (scale >= 3) return 'png@3x';
+    if (true) return 'png@3x';
     if (scale >= 2) return 'png@2x';
     return 'png@1x';

[Survived] EqualityOperator
components/Buttons/GoogleButtons.tsx:396:9
 const getDensity = () => {
     const scale = PixelRatio.get();
     if (scale >= 4) return 'png@4x';
-    if (scale >= 3) return 'png@3x';
+    if (scale > 3) return 'png@3x';
     if (scale >= 2) return 'png@2x';
     return 'png@1x';

[Survived] EqualityOperator
components/Buttons/GoogleButtons.tsx:397:9
     const scale = PixelRatio.get();
     if (scale >= 4) return 'png@4x';
     if (scale >= 3) return 'png@3x';
-    if (scale >= 2) return 'png@2x';
+    if (scale < 2) return 'png@2x';
     return 'png@1x';
 };

[Survived] ConditionalExpression
components/Buttons/GoogleButtons.tsx:397:9
     const scale = PixelRatio.get();
     if (scale >= 4) return 'png@4x';
     if (scale >= 3) return 'png@3x';
-    if (scale >= 2) return 'png@2x';
+    if (true) return 'png@2x';
     return 'png@1x';
 };

[Survived] StringLiteral
components/Buttons/GoogleButtons.tsx:398:12
     if (scale >= 4) return 'png@4x';
     if (scale >= 3) return 'png@3x';
     if (scale >= 2) return 'png@2x';
-    return 'png@1x';
+    return "";
 };
 

[Survived] ArrowFunction
components/Buttons/GoogleButtons.tsx:401:72
     return 'png@1x';
 };
 
-const GoogleButton = ({ theme = 'light', styleType = 'rd_ctn', onPress=() => console.log('Google Sign-In Pressed') }) => {
+const GoogleButton = ({ theme = 'light', styleType = 'rd_ctn', onPress=() => undefined }) => {
     const platform = Platform.OS; // 'android', 'ios', or 'web'
     const density = getDensity();

[Survived] BlockStatement
components/Buttons/GoogleButtons.tsx:401:122
     return 'png@1x';
 };
 
-const GoogleButton = ({ theme = 'light', styleType = 'rd_ctn', onPress=() => console.log('Google Sign-In Pressed') }) => {
-    const platform = Platform.OS; // 'android', 'ios', or 'web'
-    const density = getDensity();
-
-    // Obtener la imagen correcta, ahora también para web con densidades
-    const imageSource =
-        images[platform]?.[theme]?.[density]?.[styleType] || images.web.neutral['@1x'];
-
-    return (
-        <TouchableOpacity onPress={onPress} style={styles.button}>
-            <Image source={imageSource} style={styles.image} resizeMode="contain" />
-        </TouchableOpacity>
-    );
-};
+const GoogleButton = ({ theme = 'light', styleType = 'rd_ctn', onPress=() => console.log('Google Sign-In Pressed') }) => {};
 
 const styles = StyleSheet.create({

[Survived] OptionalChaining
components/Buttons/GoogleButtons.tsx:407:9
 
     // Obtener la imagen correcta, ahora también para web con densidades
     const imageSource =
-        images[platform]?.[theme]?.[density]?.[styleType] || images.web.neutral['@1x'];
+        images[platform][theme]?.[density]?.[styleType] || images.web.neutral['@1x'];
 
     return (

[Survived] OptionalChaining
components/Buttons/GoogleButtons.tsx:407:9
 
     // Obtener la imagen correcta, ahora también para web con densidades
     const imageSource =
-        images[platform]?.[theme]?.[density]?.[styleType] || images.web.neutral['@1x'];
+        images[platform]?.[theme][density]?.[styleType] || images.web.neutral['@1x'];
 
     return (

[Survived] ObjectLiteral
components/Buttons/GoogleButtons.tsx:417:13
 };
 
 const styles = StyleSheet.create({
-    button: {
-//         width: 200,
-//         height: 50,
-        alignItems: 'center',
-        justifyContent: 'center',
-    },
+    button: {},
     image: {
         width: 180,

[Survived] StringLiteral
components/Buttons/GoogleButtons.tsx:420:21
     button: {
 //         width: 200,
 //         height: 50,
-        alignItems: 'center',
+        alignItems: "",
         justifyContent: 'center',
     },
