[Survived] ArrayDeclaration
components/EditScreenInfo.tsx:22:18
         </Text>
 
         <View
-          style={[styles.codeHighlightContainer, styles.homeScreenFilename]}
+          style={[]}
           darkColor="rgba(255,255,255,0.05)"
           lightColor="rgba(0,0,0,0.05)">

[Survived] ObjectLiteral
components/EditScreenInfo.tsx:57:27
   homeScreenFilename: {
     marginVertical: 7,
   },
-  codeHighlightContainer: {
-    borderRadius: 3,
-    paddingHorizontal: 4,
-  },
+  codeHighlightContainer: {},
   getStartedText: {
     fontSize: 17,

[Survived] StringLiteral
components/EditScreenInfo.tsx:64:16
   getStartedText: {
     fontSize: 17,
     lineHeight: 24,
-    textAlign: 'center',
+    textAlign: "",
   },
   helpContainer: {

[Survived] ObjectLiteral
components/EditScreenInfo.tsx:66:18
     lineHeight: 24,
     textAlign: 'center',
   },
-  helpContainer: {
-    marginTop: 15,
-    marginHorizontal: 20,
-    alignItems: 'center',
-  },
+  helpContainer: {},
   helpLink: {
     paddingVertical: 15,

[Survived] ObjectLiteral
components/EditScreenInfo.tsx:74:17
   helpLink: {
     paddingVertical: 15,
   },
-  helpLinkText: {
-    textAlign: 'center',
-  },
+  helpLinkText: {},
 });
 

[Survived] StringLiteral
components/EditScreenInfo.tsx:75:16
     paddingVertical: 15,
   },
   helpLinkText: {
-    textAlign: 'center',
+    textAlign: "",
   },
 });
