[Survived] BlockStatement
components/ExternalLink.tsx:8:3
 
 export function ExternalLink(
   props: Omit<React.ComponentProps<typeof Link>, 'href'> & { href: string }
-) {
-  return (
-    <Link
-      target="_blank"
-      {...props}
-      // @ts-expect-error: External URLs are not typed.
-      href={props.href}
-      onPress={(e) => {
-        if (Platform.OS !== 'web') {
-          // Prevent the default behavior of linking to the default browser on native.
-          e.preventDefault();
-          // Open the link in an in-app browser.
-          WebBrowser.openBrowserAsync(props.href as string);
-        }
-      }}
-    />
-  );
-}
+) {}
 

[Survived] BlockStatement
components/ExternalLink.tsx:15:23
       {...props}
       // @ts-expect-error: External URLs are not typed.
       href={props.href}
-      onPress={(e) => {
-        if (Platform.OS !== 'web') {
-          // Prevent the default behavior of linking to the default browser on native.
-          e.preventDefault();
-          // Open the link in an in-app browser.
-          WebBrowser.openBrowserAsync(props.href as string);
-        }
-      }}
+      onPress={(e) => {}}
     />
   );

[Survived] BlockStatement
components/ExternalLink.tsx:16:36
       // @ts-expect-error: External URLs are not typed.
       href={props.href}
       onPress={(e) => {
-        if (Platform.OS !== 'web') {
-          // Prevent the default behavior of linking to the default browser on native.
-          e.preventDefault();
-          // Open the link in an in-app browser.
-          WebBrowser.openBrowserAsync(props.href as string);
-        }
+        if (Platform.OS !== 'web') {}
       }}
     />

[Survived] EqualityOperator
components/ExternalLink.tsx:16:13
       // @ts-expect-error: External URLs are not typed.
       href={props.href}
       onPress={(e) => {
-        if (Platform.OS !== 'web') {
+        if (Platform.OS === 'web') {
           // Prevent the default behavior of linking to the default browser on native.
           e.preventDefault();
