[Survived] BlockStatement
components/ListAnItem/Buttons.tsx:4:35
 import { StyleSheet, Text, View, TouchableOpacity } from 'react-native'
 import React from 'react'
 
-export default function Buttons() {
-    return (
-        <View style={styles.buttonContainer}>
-          <TouchableOpacity style={styles.draftButton}
-                            onPress={() => alert(`Pressed on 'Save to drafts' button.`)}>
-            <Text style={styles.draftButtonText}>Save to drafts</Text>
-          </TouchableOpacity>
-          <TouchableOpacity style={styles.postButton}
-                            onPress={() => alert(`Pressed on 'Post listing' button.`)} >
-            <Text style={styles.postButtonText}>Post listing</Text>
-          </TouchableOpacity>
-        </View>
-    )
-}
+export default function Buttons() {}
 
 const styles = StyleSheet.create({

[Survived] ArrowFunction
components/ListAnItem/Buttons.tsx:8:38
     return (
         <View style={styles.buttonContainer}>
           <TouchableOpacity style={styles.draftButton}
-                            onPress={() => alert(`Pressed on 'Save to drafts' button.`)}>
+                            onPress={() => undefined}>
             <Text style={styles.draftButtonText}>Save to drafts</Text>
           </TouchableOpacity>

[Survived] ArrowFunction
components/ListAnItem/Buttons.tsx:12:38
             <Text style={styles.draftButtonText}>Save to drafts</Text>
           </TouchableOpacity>
           <TouchableOpacity style={styles.postButton}
-                            onPress={() => alert(`Pressed on 'Post listing' button.`)} >
+                            onPress={() => undefined} >
             <Text style={styles.postButtonText}>Post listing</Text>
           </TouchableOpacity>

[Survived] StringLiteral
components/ListAnItem/Buttons.tsx:28:26
         flexDirection: 'row',
         justifyContent: 'space-between',
         padding: 20,
-        backgroundColor: 'white', // Keeps the background solid when scrolling
+        backgroundColor: "", // Keeps the background solid when scrolling
     },
     draftButton: {

[Survived] ObjectLiteral
components/ListAnItem/Buttons.tsx:30:18
         padding: 20,
         backgroundColor: 'white', // Keeps the background solid when scrolling
     },
-    draftButton: {
-       flex: 1,
-       borderWidth: 1,
-       borderColor: 'black',
-       padding: 12,
-       borderRadius: 5,
-       alignItems: 'center',
-       marginRight: 10,
-    },
+    draftButton: {},
     draftButtonText: {
        color: 'black',

[Survived] StringLiteral
components/ListAnItem/Buttons.tsx:36:20
        borderColor: 'black',
        padding: 12,
        borderRadius: 5,
-       alignItems: 'center',
+       alignItems: "",
        marginRight: 10,
     },

[Survived] ObjectLiteral
components/ListAnItem/Buttons.tsx:43:17
        color: 'black',
        fontSize: 16,
     },
-    postButton: {
-       flex: 1,
-       backgroundColor: 'black',
-       padding: 12,
-       borderRadius: 5,
-       alignItems: 'center',
-    },
+    postButton: {},
     postButtonText: {
        color: 'white',

[Survived] StringLiteral
components/ListAnItem/Buttons.tsx:45:25
     },
     postButton: {
        flex: 1,
-       backgroundColor: 'black',
+       backgroundColor: "",
        padding: 12,
        borderRadius: 5,

[Survived] ObjectLiteral
components/ListAnItem/Buttons.tsx:50:21
        borderRadius: 5,
        alignItems: 'center',
     },
-    postButtonText: {
-       color: 'white',
-       fontSize: 16,
-    },
+    postButtonText: {},
 })
