[Survived] BlockStatement
components/ListAnItem/ImageUploader.tsx:8:33
 export default function ImageUploader() {
   const [images, setImages] = useState<string[]>([]);
 
-  const pickImage = async () => {
-    let result = await ImagePicker.launchImageLibraryAsync({
-      mediaTypes: ImagePicker.MediaTypeOptions.Images,
-      allowsEditing: true,
-      aspect: [1, 1],
-      quality: 1,
-    });
-
-    if (!result.canceled) {
-      setImages([...images, result.assets[0].uri]); // Add new image to the list
-    }
-  };
+  const pickImage = async () => {};
 
   return (

[Survived] BlockStatement
components/ListAnItem/ImageUploader.tsx:16:27
       quality: 1,
     });
 
-    if (!result.canceled) {
-      setImages([...images, result.assets[0].uri]); // Add new image to the list
-    }
+    if (!result.canceled) {}
   };
 

[Survived] ArrowFunction
components/ListAnItem/ImageUploader.tsx:26:23
       <FlatList
         data={[...images, 'add']} // Show images + an add button
         horizontal
-        keyExtractor={(item, index) => index.toString()}
+        keyExtractor={() => undefined}
         showsHorizontalScrollIndicator={false}
         renderItem={({ item }) =>

[Survived] BooleanLiteral
components/ListAnItem/ImageUploader.tsx:27:41
         data={[...images, 'add']} // Show images + an add button
         horizontal
         keyExtractor={(item, index) => index.toString()}
-        showsHorizontalScrollIndicator={false}
+        showsHorizontalScrollIndicator={true}
         renderItem={({ item }) =>
           item === 'add' ? (

[Survived] ArrowFunction
components/ListAnItem/ImageUploader.tsx:28:21
         horizontal
         keyExtractor={(item, index) => index.toString()}
         showsHorizontalScrollIndicator={false}
-        renderItem={({ item }) =>
-          item === 'add' ? (
-            <TouchableOpacity style={styles.addButton} onPress={pickImage}>
-              <Text style={{fontSize: 32}}>+</Text>
-            </TouchableOpacity>
-          ) : (
-            <Image source={{ uri: item }} style={styles.image} />
-          )
+        renderItem={() => undefined
         }
       />

[Survived] ConditionalExpression
components/ListAnItem/ImageUploader.tsx:29:11
         keyExtractor={(item, index) => index.toString()}
         showsHorizontalScrollIndicator={false}
         renderItem={({ item }) =>
-          item === 'add' ? (
+          false ? (
             <TouchableOpacity style={styles.addButton} onPress={pickImage}>
               <Text style={{fontSize: 32}}>+</Text>

[Survived] EqualityOperator
components/ListAnItem/ImageUploader.tsx:29:11
         keyExtractor={(item, index) => index.toString()}
         showsHorizontalScrollIndicator={false}
         renderItem={({ item }) =>
-          item === 'add' ? (
+          item !== 'add' ? (
             <TouchableOpacity style={styles.addButton} onPress={pickImage}>
               <Text style={{fontSize: 32}}>+</Text>

[Survived] ObjectLiteral
components/ListAnItem/ImageUploader.tsx:34:28
               <Text style={{fontSize: 32}}>+</Text>
             </TouchableOpacity>
           ) : (
-            <Image source={{ uri: item }} style={styles.image} />
+            <Image source={{}} style={styles.image} />
           )
         }

[Survived] ObjectLiteral
components/ListAnItem/ImageUploader.tsx:46:14
   container: {
     padding: 10,
   },
-  addButton: {
-    width: 80,
-    height: 80,
-    borderWidth: 1,
-    borderColor: 'red', // Red dotted border
-    borderStyle: 'dashed',
-    justifyContent: 'center',
-    alignItems: 'center',
-    marginRight: 10,
-    alignContent: 'center',
-  },
+  addButton: {},
   plusIcon: {
     width: 40,

[Survived] StringLiteral
components/ListAnItem/ImageUploader.tsx:50:18
     width: 80,
     height: 80,
     borderWidth: 1,
-    borderColor: 'red', // Red dotted border
+    borderColor: "", // Red dotted border
     borderStyle: 'dashed',
     justifyContent: 'center',

[Survived] StringLiteral
components/ListAnItem/ImageUploader.tsx:52:21
     borderWidth: 1,
     borderColor: 'red', // Red dotted border
     borderStyle: 'dashed',
-    justifyContent: 'center',
+    justifyContent: "",
     alignItems: 'center',
     marginRight: 10,
