[Survived] StringLiteral
components/ListAnItem/ListItem.tsx:38:103
                         multiline={true}/>
                 </View>
                 {/*Divider*/}
-                <View style={{marginTop: 20, marginBottom: 20, height: 5, borderWidth: 5, borderColor:'grey'}}/>
+                <View style={{marginTop: 20, marginBottom: 20, height: 5, borderWidth: 5, borderColor:""}}/>
                 {/* Item details */}
                 <Selector type="Category"/> 

[Survived] ObjectLiteral
components/ListAnItem/ListItem.tsx:57:13
         backgroundColor: 'white',
         flex:1,
     },
-    topBar: {
-        alignContent: 'center',
-        alignItems: 'center',
-        height: 50,
-        flexDirection: 'row',
-        marginBottom: 10,
-        shadowColor: '#000',
-        shadowOffset: {width: 0, height: 4},
-        shadowOpacity: 0.1,
-        shadowRadius: 4,
-    },
+    topBar: {},
     scrollView: {
         flexGrow: 1,
