[Survived] BlockStatement
components/ListAnItem/Selector.tsx:3:59
 import { StyleSheet, Text, TouchableOpacity } from 'react-native'
 
-export default function Selector({type} : {type: string}) {
-    return (
-        <TouchableOpacity style={styles.selectorContainer} onPress={() => alert(`Pressed on ${type} button.`)}>
-            <Text style={styles.selectorLabel}>{type}</Text>
-            <Text style={styles.selectorText}>Select &gt;</Text>
-        </TouchableOpacity>
-    )
-}
+export default function Selector({type} : {type: string}) {}
 
 const styles = StyleSheet.create({

[Survived] ArrowFunction
components/ListAnItem/Selector.tsx:5:69
 
 export default function Selector({type} : {type: string}) {
     return (
-        <TouchableOpacity style={styles.selectorContainer} onPress={() => alert(`Pressed on ${type} button.`)}>
+        <TouchableOpacity style={styles.selectorContainer} onPress={() => undefined}>
             <Text style={styles.selectorLabel}>{type}</Text>
             <Text style={styles.selectorText}>Select &gt;</Text>

[Survived] StringLiteral
components/ListAnItem/Selector.tsx:5:81
 
 export default function Selector({type} : {type: string}) {
     return (
-        <TouchableOpacity style={styles.selectorContainer} onPress={() => alert(`Pressed on ${type} button.`)}>
+        <TouchableOpacity style={styles.selectorContainer} onPress={() => alert(``)}>
             <Text style={styles.selectorLabel}>{type}</Text>
             <Text style={styles.selectorText}>Select &gt;</Text>

[Survived] ObjectLiteral
components/ListAnItem/Selector.tsx:27:19
         fontSize: 16,
         color: '#333',
     },
-    selectorText: {
-        fontSize: 12,
-        color: '#888', 
-    },
+    selectorText: {},
 });
