[Survived] BlockStatement
components/ListingDescription.tsx:17:43
   sellerDetails: Seller;
   location: Location;
 }) {
-  const handleContactSellerButton = () => {
-    alert("Pressed contact seller button!");
-  };
+  const handleContactSellerButton = () => {};
   const handleWishlistItemButton = () => {
     alert("Pressed wishlist item button!");

[Survived] StringLiteral
components/ListingDescription.tsx:18:11
   location: Location;
 }) {
   const handleContactSellerButton = () => {
-    alert("Pressed contact seller button!");
+    alert("");
   };
   const handleWishlistItemButton = () => {

[Survived] BlockStatement
components/ListingDescription.tsx:20:42
   const handleContactSellerButton = () => {
     alert("Pressed contact seller button!");
   };
-  const handleWishlistItemButton = () => {
-    alert("Pressed wishlist item button!");
-  };
+  const handleWishlistItemButton = () => {};
 
   return (

[Survived] StringLiteral
components/ListingDescription.tsx:62:22
         style={{
           fontSize: 18,
           fontWeight: "500",
-          fontStyle: "italic",
+          fontStyle: "",
           color: "black",
         }}

[Survived] StringLiteral
components/ListingDescription.tsx:63:18
           fontSize: 18,
           fontWeight: "500",
           fontStyle: "italic",
-          color: "black",
+          color: "",
         }}
       >

[Survived] ObjectLiteral
components/ListingDescription.tsx:80:20
     padding: 5,
     backgroundColor: "white",
   },
-  buttonContainer: {
-    padding: 15,
-    borderRadius: 10,
-    borderWidth: 1,
-    borderColor: "#ccc",
-    backgroundColor: "white",
-    alignItems: "center",
-    justifyContent: "center",
-    marginBottom: 20,
-  },
+  buttonContainer: {},
   infoBox: {
     backgroundColor: "white",

[Survived] StringLiteral
components/ListingDescription.tsx:85:22
     borderRadius: 10,
     borderWidth: 1,
     borderColor: "#ccc",
-    backgroundColor: "white",
+    backgroundColor: "",
     alignItems: "center",
     justifyContent: "center",

[Survived] ObjectLiteral
components/ListingDescription.tsx:90:12
     justifyContent: "center",
     marginBottom: 20,
   },
-  infoBox: {
-    backgroundColor: "white",
-    width: "100%",
-    borderRadius: 10,
-    minHeight: 120,
-    padding: 10,
-    marginTop: 5,
-    borderWidth: 1,
-    marginBottom: 20,
-
-    // Bottom shadow
-    shadowColor: "#000",
-    shadowOffset: { width: 0, height: 3 },
-    shadowOpacity: 0.3,
-    shadowRadius: 4,
-  },
+  infoBox: {},
   descriptionText: {
     color: "black",

[Survived] StringLiteral
components/ListingDescription.tsx:92:12
   },
   infoBox: {
     backgroundColor: "white",
-    width: "100%",
+    width: "",
     borderRadius: 10,
     minHeight: 120,

[Survived] ObjectLiteral
components/ListingDescription.tsx:102:19
 
     // Bottom shadow
     shadowColor: "#000",
-    shadowOffset: { width: 0, height: 3 },
+    shadowOffset: {},
     shadowOpacity: 0.3,
     shadowRadius: 4,

[Survived] ObjectLiteral
components/ListingDescription.tsx:106:20
     shadowOpacity: 0.3,
     shadowRadius: 4,
   },
-  descriptionText: {
-    color: "black",
-    fontWeight: "400",
-    fontStyle: "italic",
-  },
+  descriptionText: {},
 });
 

[Survived] StringLiteral
components/ListingDescription.tsx:107:12
     shadowRadius: 4,
   },
   descriptionText: {
-    color: "black",
+    color: "",
     fontWeight: "400",
     fontStyle: "italic",

[Survived] StringLiteral
components/ListingDescription.tsx:108:17
   },
   descriptionText: {
     color: "black",
-    fontWeight: "400",
+    fontWeight: "",
     fontStyle: "italic",
   },

[Survived] StringLiteral
components/ListingDescription.tsx:109:16
   descriptionText: {
     color: "black",
     fontWeight: "400",
-    fontStyle: "italic",
+    fontStyle: "",
   },
 });
