[Survived] ArrowFunction
components/ListingsPage/CategoryDropdown.tsx:22:39
                       testID="categories-dropdown"
                       itemTestIDField="value"
                       style={styles.categoryDropdown}
-                      renderLeftIcon={() => (
-                        <FontAwesome
-                          name="bars"
-                          style={{ marginRight: 10 }}
-                          size={14}
-                        />
-                      )}
+                      renderLeftIcon={() => undefined}
                       onFocus={() => setDropdownFocus(true)}
                       onBlur={() => setDropdownFocus(false)}

[Survived] ObjectLiteral
components/ListingsPage/CategoryDropdown.tsx:25:34
                       renderLeftIcon={() => (
                         <FontAwesome
                           name="bars"
-                          style={{ marginRight: 10 }}
+                          style={{}}
                           size={14}
                         />

[Survived] ArrowFunction
components/ListingsPage/CategoryDropdown.tsx:29:32
                           size={14}
                         />
                       )}
-                      onFocus={() => setDropdownFocus(true)}
+                      onFocus={() => undefined}
                       onBlur={() => setDropdownFocus(false)}
                       placeholder={dropdownFocus ? "Select Category" : "..."}

[Survived] BooleanLiteral
components/ListingsPage/CategoryDropdown.tsx:29:55
                           size={14}
                         />
                       )}
-                      onFocus={() => setDropdownFocus(true)}
+                      onFocus={() => setDropdownFocus(false)}
                       onBlur={() => setDropdownFocus(false)}
                       placeholder={dropdownFocus ? "Select Category" : "..."}

[Survived] ArrowFunction
components/ListingsPage/CategoryDropdown.tsx:30:31
                         />
                       )}
                       onFocus={() => setDropdownFocus(true)}
-                      onBlur={() => setDropdownFocus(false)}
+                      onBlur={() => undefined}
                       placeholder={dropdownFocus ? "Select Category" : "..."}
                       labelField={"label"}

[Survived] BooleanLiteral
components/ListingsPage/CategoryDropdown.tsx:30:54
                         />
                       )}
                       onFocus={() => setDropdownFocus(true)}
-                      onBlur={() => setDropdownFocus(false)}
+                      onBlur={() => setDropdownFocus(true)}
                       placeholder={dropdownFocus ? "Select Category" : "..."}
                       labelField={"label"}

[Survived] StringLiteral
components/ListingsPage/CategoryDropdown.tsx:31:72
                       )}
                       onFocus={() => setDropdownFocus(true)}
                       onBlur={() => setDropdownFocus(false)}
-                      placeholder={dropdownFocus ? "Select Category" : "..."}
+                      placeholder={dropdownFocus ? "Select Category" : ""}
                       labelField={"label"}
                       valueField={"value"}

[Killed] ArrowFunction
components/ListingsPage/CategoryDropdown.tsx:36:33
                       valueField={"value"}
                       data={categories}
                       value={category}
-                      onChange={(value) => setCategory(value)}
+                      onChange={() => undefined}
                     />
     </>
killedBy: Category Dropdown should select category
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"label": "electronics", "value": "Electronics"}

Number of calls: 0
