[Survived] BooleanLiteral
components/ListingsPage/CollapsibleView.tsx:16:57
 
 export default function CollapsibleView({startContent, title, children, noArrow, expandedHeight}: CollapsibleViewProps) {
   const [animation, setAnimation] = useState<Animated.Value>(new Animated.Value(0))
-  const [isCollapsed, setCollapsed] = useState<boolean>(true)
+  const [isCollapsed, setCollapsed] = useState<boolean>(false)
   
   const toggleCollapsed = () => {

[Survived] BlockStatement
components/ListingsPage/CollapsibleView.tsx:18:33
   const [animation, setAnimation] = useState<Animated.Value>(new Animated.Value(0))
   const [isCollapsed, setCollapsed] = useState<boolean>(true)
   
-  const toggleCollapsed = () => {
-    if (!isCollapsed) {
-      Animated.timing(animation, {
-        toValue: 1,
-        duration: 300,
-        useNativeDriver: false
-      }).start();
-    } else {
-      Animated.timing(animation, {
-        toValue: 0,
-        duration: 300,
-        useNativeDriver: false
-      }).start();
-    }
-    setCollapsed(!isCollapsed);
-  }
+  const toggleCollapsed = () => {}
 
   const heightInterpolate = animation.interpolate({

[Survived] ConditionalExpression
components/ListingsPage/CollapsibleView.tsx:19:9
   const [isCollapsed, setCollapsed] = useState<boolean>(true)
   
   const toggleCollapsed = () => {
-    if (!isCollapsed) {
+    if (false) {
       Animated.timing(animation, {
         toValue: 1,

[Survived] BooleanLiteral
components/ListingsPage/CollapsibleView.tsx:19:9
   const [isCollapsed, setCollapsed] = useState<boolean>(true)
   
   const toggleCollapsed = () => {
-    if (!isCollapsed) {
+    if (isCollapsed) {
       Animated.timing(animation, {
         toValue: 1,

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:20:34
   
   const toggleCollapsed = () => {
     if (!isCollapsed) {
-      Animated.timing(animation, {
-        toValue: 1,
-        duration: 300,
-        useNativeDriver: false
-      }).start();
+      Animated.timing(animation, {}).start();
     } else {
       Animated.timing(animation, {

[Survived] BooleanLiteral
components/ListingsPage/CollapsibleView.tsx:23:26
       Animated.timing(animation, {
         toValue: 1,
         duration: 300,
-        useNativeDriver: false
+        useNativeDriver: true
       }).start();
     } else {

[Survived] BlockStatement
components/ListingsPage/CollapsibleView.tsx:25:12
         duration: 300,
         useNativeDriver: false
       }).start();
-    } else {
-      Animated.timing(animation, {
-        toValue: 0,
-        duration: 300,
-        useNativeDriver: false
-      }).start();
-    }
+    } else {}
     setCollapsed(!isCollapsed);
   }

[Survived] BooleanLiteral
components/ListingsPage/CollapsibleView.tsx:32:18
         useNativeDriver: false
       }).start();
     }
-    setCollapsed(!isCollapsed);
+    setCollapsed(isCollapsed);
   }
 

[Killed] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:35:51
     setCollapsed(!isCollapsed);
   }
 
-  const heightInterpolate = animation.interpolate({
-    inputRange: [0, 1],
-    outputRange: [0, expandedHeight]
-  })
+  const heightInterpolate = animation.interpolate({})
 
   const rotateInterpolate = animation.interpolate({
killedBy: FilterMenu price and distance sliders Distance Slider updates state correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
components/ListingsPage/CollapsibleView.tsx:37:18
 
   const heightInterpolate = animation.interpolate({
     inputRange: [0, 1],
-    outputRange: [0, expandedHeight]
+    outputRange: []
   })
 
killedBy: FilterMenu price and distance sliders Distance Slider updates state correctly
statusReason: Invariant Violation: outputRange must have at least 2 elements

[Killed] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:40:51
     outputRange: [0, expandedHeight]
   })
 
-  const rotateInterpolate = animation.interpolate({
-    inputRange: [0, 1],
-    outputRange: ["0deg", "-90deg"]
-  })
+  const rotateInterpolate = animation.interpolate({})
 
   return (
killedBy: FilterMenu price and distance sliders Distance Slider updates state correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:46:18
   })
 
   return (
-    <View style={{borderBottomColor: "black", borderBottomWidth: 1}}>
+    <View style={{}}>
       <TouchableWithoutFeedback onPress={toggleCollapsed}>
         <View style={styles.header}>

[Survived] ConditionalExpression
components/ListingsPage/CollapsibleView.tsx:53:10
           {startContent}
           <Text>{title}</Text>
         </View>
-        {(!noArrow) && 
-        <Animated.View  style={{transform: [{rotate: rotateInterpolate}], alignItems: "center", padding: 10}}>
-          <FontAwesome name='angle-left' size={24} />
-        </Animated.View>
+        {false
         }
         </View>

[Survived] LogicalOperator
components/ListingsPage/CollapsibleView.tsx:53:10
           {startContent}
           <Text>{title}</Text>
         </View>
-        {(!noArrow) && 
-        <Animated.View  style={{transform: [{rotate: rotateInterpolate}], alignItems: "center", padding: 10}}>
-          <FontAwesome name='angle-left' size={24} />
-        </Animated.View>
+        {!noArrow || <Animated.View style={{
+  transform: [{
+    rotate: rotateInterpolate
+  }],
+  alignItems: "center",
+  padding: 10
+}}>
+          <FontAwesome name='angle-left' size={24} />
+        </Animated.View>
         }
         </View>

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:54:32
           <Text>{title}</Text>
         </View>
         {(!noArrow) && 
-        <Animated.View  style={{transform: [{rotate: rotateInterpolate}], alignItems: "center", padding: 10}}>
+        <Animated.View  style={{}}>
           <FontAwesome name='angle-left' size={24} />
         </Animated.View>

[Survived] StringLiteral
components/ListingsPage/CollapsibleView.tsx:54:87
           <Text>{title}</Text>
         </View>
         {(!noArrow) && 
-        <Animated.View  style={{transform: [{rotate: rotateInterpolate}], alignItems: "center", padding: 10}}>
+        <Animated.View  style={{transform: [{rotate: rotateInterpolate}], alignItems: "", padding: 10}}>
           <FontAwesome name='angle-left' size={24} />
         </Animated.View>

[Survived] StringLiteral
components/ListingsPage/CollapsibleView.tsx:60:67
         }
         </View>
       </TouchableWithoutFeedback>
-      <Animated.View style={{height: heightInterpolate, overflow: 'hidden'}}>
+      <Animated.View style={{height: heightInterpolate, overflow: ""}}>
         {children}
       </Animated.View>

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:60:29
         }
         </View>
       </TouchableWithoutFeedback>
-      <Animated.View style={{height: heightInterpolate, overflow: 'hidden'}}>
+      <Animated.View style={{}}>
         {children}
       </Animated.View>

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:67:34
   )
 }
 
-const styles = StyleSheet.create({
-  title_icon: {
-    flexDirection:"row", 
-    alignItems: "center", 
-    justifyContent: "flex-start",
-    gap: 5,
-    padding: 10
-  },
-  header: {
-    flexDirection: "row",
-    justifyContent: "space-between"
-  },
-})
+const styles = StyleSheet.create({})

[Survived] StringLiteral
components/ListingsPage/CollapsibleView.tsx:71:21
   title_icon: {
     flexDirection:"row", 
     alignItems: "center", 
-    justifyContent: "flex-start",
+    justifyContent: "",
     gap: 5,
     padding: 10

[Survived] ObjectLiteral
components/ListingsPage/CollapsibleView.tsx:75:11
     gap: 5,
     padding: 10
   },
-  header: {
-    flexDirection: "row",
-    justifyContent: "space-between"
-  },
+  header: {},
 })
