[Survived] ObjectLiteral
components/ListingsPage/FilterMenu.tsx:16:3
     label: "Electronics",
     value: "electronics",
   },
-  {
-    label: "Clothing",
-    value: "clothing",
-  },
+  {},
   {
     label: "Furniture",

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:17:12
     value: "electronics",
   },
   {
-    label: "Clothing",
+    label: "",
     value: "clothing",
   },

[Survived] BooleanLiteral
components/ListingsPage/FilterMenu.tsx:36:69
   const [price, setPrice] = React.useState<number>(1);
   const [category, setCategory] = React.useState<string>("");
   const [sellerRep, setSellerRep] = React.useState<number>(5);
-  const [filterApplied, setFilterApplied] = React.useState<boolean>(false);
+  const [filterApplied, setFilterApplied] = React.useState<boolean>(true);
   const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(false);
 

[Survived] BooleanLiteral
components/ListingsPage/FilterMenu.tsx:37:69
   const [category, setCategory] = React.useState<string>("");
   const [sellerRep, setSellerRep] = React.useState<number>(5);
   const [filterApplied, setFilterApplied] = React.useState<boolean>(false);
-  const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(false);
+  const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(true);
 
   useEffect(() => {

[Killed] BlockStatement
components/ListingsPage/FilterMenu.tsx:39:19
   const [filterApplied, setFilterApplied] = React.useState<boolean>(false);
   const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(false);
 
-  useEffect(() => {
-    if (filterApplied) {
-      // Refetch Filter Data from API
-      // Setting data to the same for development purposes
-      setData(data);
-      console.log("Filters Applied:", distance, price, category, sellerRep);
-      setFilterApplied(false);
-    }
-  }, [filterApplied]);
+  useEffect(() => {}, [filterApplied]);
 
   return (
killedBy: FilterMenu apply filters and clears them should apply filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
components/ListingsPage/FilterMenu.tsx:40:9
   const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(false);
 
   useEffect(() => {
-    if (filterApplied) {
+    if (false) {
       // Refetch Filter Data from API
       // Setting data to the same for development purposes
killedBy: FilterMenu apply filters and clears them should apply filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
components/ListingsPage/FilterMenu.tsx:40:24
   const [dropdownFocus, setDropdownFocus] = React.useState<boolean>(false);
 
   useEffect(() => {
-    if (filterApplied) {
-      // Refetch Filter Data from API
-      // Setting data to the same for development purposes
-      setData(data);
-      console.log("Filters Applied:", distance, price, category, sellerRep);
-      setFilterApplied(false);
-    }
+    if (filterApplied) {}
   }, [filterApplied]);
 
killedBy: FilterMenu apply filters and clears them should apply filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:44:19
       // Refetch Filter Data from API
       // Setting data to the same for development purposes
       setData(data);
-      console.log("Filters Applied:", distance, price, category, sellerRep);
+      console.log("", distance, price, category, sellerRep);
       setFilterApplied(false);
     }

[Survived] BooleanLiteral
components/ListingsPage/FilterMenu.tsx:45:24
       // Setting data to the same for development purposes
       setData(data);
       console.log("Filters Applied:", distance, price, category, sellerRep);
-      setFilterApplied(false);
+      setFilterApplied(true);
     }
   }, [filterApplied]);

[Killed] ArrowFunction
components/ListingsPage/FilterMenu.tsx:69:36
                 thumbTintColor="green"
                 maximumTrackTintColor="gray"
                 minimumTrackTintColor="green"
-                onSlidingComplete={(value) => setPrice(value)}
+                onSlidingComplete={() => undefined}
               />
             </View>
killedBy: FilterMenu price and distance sliders Price Slider updates state correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 1

[Killed] ArrowFunction
components/ListingsPage/FilterMenu.tsx:83:36
                 maximumValue={500}
                 maximumTrackTintColor="gray"
                 minimumTrackTintColor="green"
-                onSlidingComplete={(value) => setDistance(value)}
+                onSlidingComplete={() => undefined}
               />
             </View>
killedBy: FilterMenu price and distance sliders Distance Slider updates state correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 1

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:116:28
         <View
           style={{
             padding: 10,
-            flexDirection: "row",
+            flexDirection: "",
             justifyContent: "center",
             width: "100%",

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:117:29
           style={{
             padding: 10,
             flexDirection: "row",
-            justifyContent: "center",
+            justifyContent: "",
             width: "100%",
             gap: 10,

[Killed] ArrowFunction
components/ListingsPage/FilterMenu.tsx:125:22
           <Pressable
             testID="apply-filters-button"
             style={styles.applyFilters}
-            onPress={() => setFilterApplied(true)}
+            onPress={() => undefined}
           >
             <Text style={{ color: "white", fontSize: 18, fontWeight: "bold" }}>
killedBy: FilterMenu apply filters and clears them should apply filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
components/ListingsPage/FilterMenu.tsx:125:45
           <Pressable
             testID="apply-filters-button"
             style={styles.applyFilters}
-            onPress={() => setFilterApplied(true)}
+            onPress={() => setFilterApplied(false)}
           >
             <Text style={{ color: "white", fontSize: 18, fontWeight: "bold" }}>
killedBy: FilterMenu apply filters and clears them should apply filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:127:35
             style={styles.applyFilters}
             onPress={() => setFilterApplied(true)}
           >
-            <Text style={{ color: "white", fontSize: 18, fontWeight: "bold" }}>
+            <Text style={{ color: "", fontSize: 18, fontWeight: "bold" }}>
               Apply Filters
             </Text>

[Killed] BlockStatement
components/ListingsPage/FilterMenu.tsx:134:28
           <Pressable
             testID="clear-filters-button"
             style={styles.clearFilters}
-            onPress={() => {
-              setDistance(1);
-              setPrice(1);
-              setCategory("");
-              setFilterApplied(true);
-            }}
+            onPress={() => {}}
           >
             <Text style={{ color: "red", fontSize: 18, fontWeight: "bold" }}>
killedBy: FilterMenu apply filters and clears them should clear filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:137:27
             onPress={() => {
               setDistance(1);
               setPrice(1);
-              setCategory("");
+              setCategory("Stryker was here!");
               setFilterApplied(true);
             }}

[Killed] BooleanLiteral
components/ListingsPage/FilterMenu.tsx:138:32
               setDistance(1);
               setPrice(1);
               setCategory("");
-              setFilterApplied(true);
+              setFilterApplied(false);
             }}
           >
killedBy: FilterMenu apply filters and clears them should clear filters
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:141:68
               setFilterApplied(true);
             }}
           >
-            <Text style={{ color: "red", fontSize: 18, fontWeight: "bold" }}>
+            <Text style={{ color: "red", fontSize: 18, fontWeight: "" }}>
               Clear Filters
             </Text>

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:141:35
               setFilterApplied(true);
             }}
           >
-            <Text style={{ color: "red", fontSize: 18, fontWeight: "bold" }}>
+            <Text style={{ color: "", fontSize: 18, fontWeight: "bold" }}>
               Clear Filters
             </Text>

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:157:21
     padding: 5,
   },
   filtersContainer: {
-    justifyContent: "space-between",
+    justifyContent: "",
     alignItems: "flex-start",
     padding: 10,

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:158:17
   },
   filtersContainer: {
     justifyContent: "space-between",
-    alignItems: "flex-start",
+    alignItems: "",
     padding: 10,
     gap: 10,

[Survived] StringLiteral
components/ListingsPage/FilterMenu.tsx:163:20
     gap: 10,
   },
   filterRows: {
-    flexDirection: "row",
+    flexDirection: "",
     justifyContent: "space-between",
     width: "100%",
