[Survived] BooleanLiteral
components/ListingsPage/ProductCard.tsx:27:66
   latitude,
   longitude,
 }: ProductCardProps) {
-  const [isProductWishlisted, setWishlisted] = useState<boolean>(false);
+  const [isProductWishlisted, setWishlisted] = useState<boolean>(true);
   const [distance, setDistance] = useState<number>(0);
   const [err, setErr] = useState<string | null>(null);

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:34:34
   const router = useRouter();
 
   useEffect(() => {
-    async function getLocation() {
-      let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") {
-        setErr("Permission to access location was denied");
-        return;
-      }
-      let location = await Location.getCurrentPositionAsync({});
-      setDistance(
-        getDistance(
-          {
-            latitude: location.coords.latitude,
-            longitude: location.coords.longitude,
-          },
-          { latitude: parseFloat(latitude), longitude: parseFloat(longitude) }
-        )
-      );
-    }
+    async function getLocation() {}
 
     getLocation();

[Survived] ConditionalExpression
components/ListingsPage/ProductCard.tsx:36:11
   useEffect(() => {
     async function getLocation() {
       let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") {
+      if (true) {
         setErr("Permission to access location was denied");
         return;

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:36:33
   useEffect(() => {
     async function getLocation() {
       let { status } = await Location.requestForegroundPermissionsAsync();
-      if (status !== "granted") {
-        setErr("Permission to access location was denied");
-        return;
-      }
+      if (status !== "granted") {}
       let location = await Location.getCurrentPositionAsync({});
       setDistance(

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:37:16
     async function getLocation() {
       let { status } = await Location.requestForegroundPermissionsAsync();
       if (status !== "granted") {
-        setErr("Permission to access location was denied");
+        setErr("");
         return;
       }

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:43:11
       let location = await Location.getCurrentPositionAsync({});
       setDistance(
         getDistance(
-          {
-            latitude: location.coords.latitude,
-            longitude: location.coords.longitude,
-          },
+          {},
           { latitude: parseFloat(latitude), longitude: parseFloat(longitude) }
         )

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:47:11
             latitude: location.coords.latitude,
             longitude: location.coords.longitude,
           },
-          { latitude: parseFloat(latitude), longitude: parseFloat(longitude) }
+          {}
         )
       );

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:54:18
 
     getLocation();
 
-    return () => {
-      setDistance(0);
-      setErr(null);
-    };
+    return () => {};
   }, []);
 

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:60:37
     };
   }, []);
 
-  const handleWishlistClick = () => {
-    console.log("Wishlist Button Pressed");
-    setWishlisted(!isProductWishlisted);
-    animateButton();
-  };
+  const handleWishlistClick = () => {};
 
   const animateButton = () => {

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:61:17
   }, []);
 
   const handleWishlistClick = () => {
-    console.log("Wishlist Button Pressed");
+    console.log("");
     setWishlisted(!isProductWishlisted);
     animateButton();

[Survived] BooleanLiteral
components/ListingsPage/ProductCard.tsx:62:19
 
   const handleWishlistClick = () => {
     console.log("Wishlist Button Pressed");
-    setWishlisted(!isProductWishlisted);
+    setWishlisted(isProductWishlisted);
     animateButton();
   };

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:66:31
     animateButton();
   };
 
-  const animateButton = () => {
-    Animated.sequence([
-      Animated.timing(scaleValue, {
-        toValue: 1.2,
-        duration: 100,
-        useNativeDriver: true,
-      }),
-      Animated.timing(scaleValue, {
-        toValue: 1,
-        duration: 100,
-        useNativeDriver: true,
-      }),
-    ]).start();
-  };
+  const animateButton = () => {};
 
   const handleProductClick = () => {

[Survived] BooleanLiteral
components/ListingsPage/ProductCard.tsx:71:26
       Animated.timing(scaleValue, {
         toValue: 1.2,
         duration: 100,
-        useNativeDriver: true,
+        useNativeDriver: false,
       }),
       Animated.timing(scaleValue, {

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:73:35
         duration: 100,
         useNativeDriver: true,
       }),
-      Animated.timing(scaleValue, {
-        toValue: 1,
-        duration: 100,
-        useNativeDriver: true,
-      }),
+      Animated.timing(scaleValue, {}),
     ]).start();
   };

[Survived] BlockStatement
components/ListingsPage/ProductCard.tsx:81:36
     ]).start();
   };
 
-  const handleProductClick = () => {
-    router.push(`/listings/${id}`);
-    console.log(`Product ${id} clicked`);
-  };
+  const handleProductClick = () => {};
 
   return (

[Survived] ArithmeticOperator
components/ListingsPage/ProductCard.tsx:94:47
       <View style={styles.info}>
         <View>
           <Text style={styles.title}>{title}</Text>
-          <Text style={{ fontSize: 12 }}>{`${(distance / 1000).toFixed(
+          <Text style={{ fontSize: 12 }}>{`${(distance * 1000).toFixed(
             2
           )} km`}</Text>

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:94:43
       <View style={styles.info}>
         <View>
           <Text style={styles.title}>{title}</Text>
-          <Text style={{ fontSize: 12 }}>{`${(distance / 1000).toFixed(
-            2
-          )} km`}</Text>
+          <Text style={{ fontSize: 12 }}>{``}</Text>
         </View>
         <Text style={styles.price}>{formatCurrency(price)}</Text>

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:101:41
         <Text style={styles.price}>{formatCurrency(price)}</Text>
       </View>
       <Animated.View
-        style={[styles.wishlist_button, { transform: [{ scale: scaleValue }] }]}
+        style={[styles.wishlist_button, {}]}
       >
         <Pressable

[Survived] ArrayDeclaration
components/ListingsPage/ProductCard.tsx:101:16
         <Text style={styles.price}>{formatCurrency(price)}</Text>
       </View>
       <Animated.View
-        style={[styles.wishlist_button, { transform: [{ scale: scaleValue }] }]}
+        style={[]}
       >
         <Pressable

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:108:41
           onPress={handleWishlistClick}
         >
           <FontAwesome
-            name={isProductWishlisted ? "heart" : "heart-o"}
+            name={isProductWishlisted ? "" : "heart-o"}
             size={24}
             color={isProductWishlisted ? "red" : "gray"}

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:110:42
           <FontAwesome
             name={isProductWishlisted ? "heart" : "heart-o"}
             size={24}
-            color={isProductWishlisted ? "red" : "gray"}
+            color={isProductWishlisted ? "" : "gray"}
           />
         </Pressable>

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:119:9
 }
 
 const styles = StyleSheet.create({
-  card: {
-    borderColor: "black",
-    borderWidth: 1,
-    borderRadius: 10,
-    width: "45%",
-    boxShadow: "0px 0px 6px 0px rgba(0,0,0,0.75)",
-    aspectRatio: 1,
-    position: "relative",
-  },
+  card: {},
   image: {
     width: "100%",

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:126:15
     width: "45%",
     boxShadow: "0px 0px 6px 0px rgba(0,0,0,0.75)",
     aspectRatio: 1,
-    position: "relative",
+    position: "",
   },
   image: {

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:129:12
     position: "relative",
   },
   image: {
-    width: "100%",
+    width: "",
     height: 125,
     borderTopLeftRadius: 10,

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:134:15
     borderTopLeftRadius: 10,
     borderTopRightRadius: 10,
   },
-  image_view: {
-    display: "flex",
-    justifyContent: "center",
-    alignItems: "center",
-    borderTopEndRadius: 10,
-    borderTopStartRadius: 10,
-  },
+  image_view: {},
   wishlist_button: {
     position: "absolute",

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:137:17
   image_view: {
     display: "flex",
     justifyContent: "center",
-    alignItems: "center",
+    alignItems: "",
     borderTopEndRadius: 10,
     borderTopStartRadius: 10,

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:142:15
     borderTopStartRadius: 10,
   },
   wishlist_button: {
-    position: "absolute",
+    position: "",
     top: 5,
     right: 5,

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:149:17
     padding: 5,
     borderRadius: 10,
   },
-  seller_image: {
-    height: 40,
-    aspectRatio: 1,
-    borderRadius: 10,
-    position: "absolute",
-    top: 5,
-    left: 5,
-    borderWidth: 1,
-    borderColor: "black",
-  },
+  seller_image: {},
   title_container: {
     flex: 1,

[Survived] ObjectLiteral
components/ListingsPage/ProductCard.tsx:164:10
     margin: 5,
     flexDirection: "column",
   },
-  title: {
-    fontSize: 15,
-    fontWeight: "bold",
-  },
+  title: {},
   price: {
     fontSize: 15,

[Survived] StringLiteral
components/ListingsPage/ProductCard.tsx:166:17
   },
   title: {
     fontSize: 15,
-    fontWeight: "bold",
+    fontWeight: "",
   },
   price: {
