[Survived] BlockStatement
components/ListingsPage/SearchBar.tsx:6:37
 import React, {useState} from 'react'
 import { FontAwesome } from '@expo/vector-icons'
 
-export default function SearchBar() {
-  const [searchText, setSearchText] = useState<string>('')
-
-  const handleChanges = (text: string) => {
-    setSearchText(text);
-  }
-
-  return (
-    <View style={styles.container}>
-      <FontAwesome style={styles.searchBarIcon} name="search" size={24} color="black" />
-      <TextInput onEndEditing={() => {console.log(`Input Finished ${searchText}`)}} style={styles.searchBarInput} onChangeText={handleChanges} placeholder='Search...'/>
-    </View>
-  )
-}
+export default function SearchBar() {}
 
 

[Survived] BlockStatement
components/ListingsPage/SearchBar.tsx:9:43
 export default function SearchBar() {
   const [searchText, setSearchText] = useState<string>('')
 
-  const handleChanges = (text: string) => {
-    setSearchText(text);
-  }
+  const handleChanges = (text: string) => {}
 
   return (

[Survived] BlockStatement
components/ListingsPage/SearchBar.tsx:16:38
   return (
     <View style={styles.container}>
       <FontAwesome style={styles.searchBarIcon} name="search" size={24} color="black" />
-      <TextInput onEndEditing={() => {console.log(`Input Finished ${searchText}`)}} style={styles.searchBarInput} onChangeText={handleChanges} placeholder='Search...'/>
+      <TextInput onEndEditing={() => {}} style={styles.searchBarInput} onChangeText={handleChanges} placeholder='Search...'/>
     </View>
   )

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:16:51
   return (
     <View style={styles.container}>
       <FontAwesome style={styles.searchBarIcon} name="search" size={24} color="black" />
-      <TextInput onEndEditing={() => {console.log(`Input Finished ${searchText}`)}} style={styles.searchBarInput} onChangeText={handleChanges} placeholder='Search...'/>
+      <TextInput onEndEditing={() => {console.log(``)}} style={styles.searchBarInput} onChangeText={handleChanges} placeholder='Search...'/>
     </View>
   )

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:29:18
     margin: 10,
     borderRadius: 50,
     borderWidth : 1,
-    borderColor: 'black',
+    borderColor: "",
     flexDirection: 'row',
     alignItems: 'center',

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:31:17
     borderWidth : 1,
     borderColor: 'black',
     flexDirection: 'row',
-    alignItems: 'center',
+    alignItems: "",
     justifyContent: 'flex-start',
     borderBottomWidth: 1,

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:32:21
     borderColor: 'black',
     flexDirection: 'row',
     alignItems: 'center',
-    justifyContent: 'flex-start',
+    justifyContent: "",
     borderBottomWidth: 1,
     borderBottomColor: 'black',

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:40:22
   searchBarInput: {
     flex: 1,
     fontSize: 16,
-    backgroundColor: "white",
+    backgroundColor: "",
     padding: 5,
     borderRadius: 50,

[Survived] StringLiteral
components/ListingsPage/SearchBar.tsx:48:22
     margin: 5,
     width: 30,
     height: 30,
-    backgroundColor: 'white',
+    backgroundColor: "",
 
   }
