[Survived] ObjectLiteral
components/LocationMap.tsx:15:24
     <View style={styles.container}>
       <MapView
         style={styles.map}
-        initialRegion={{
-          latitude: latitude, // Replace with actual latitude
-          longitude: longitude, // Replace with actual longitude
-          latitudeDelta: 0.02,
-          longitudeDelta: 0.02,
-        }}
+        initialRegion={{}}
       >
         {/* Marker for the location */}

[Survived] StringLiteral
components/LocationMap.tsx:48:12
     overflow: 'hidden',
   },
   map: {
-    width: '100%',
+    width: "",
     height: 300, // Adjust size as needed
   },

[Survived] StringLiteral
components/LocationMap.tsx:54:11
   overlayText: {
     position: 'absolute',
     top: 20,
-    left: '30%',
+    left: "",
     fontSize: 16,
     fontWeight: 'bold',
