[Survived] ObjectLiteral
components/MyListingPage/DisplayMyListingPage.tsx:20:48
         </View>
         <View className='Listings' style={styles.listings}>
           <View className='Listing1' style={styles.card}>
-            <Image alt='product image' source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
+            <Image alt='product image' source={{}} style={styles.image} />
             <View className='Infomation' style={{ marginLeft: 50 }}>
               <Text style={{ fontSize: 25 }}>Lorem Ipsum</Text>

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:29:55
             <Text style={{ marginLeft: 'auto', marginRight: 25 }} className='Status'>Pending</Text>
           </View>
           <View className='Listing2' style={styles.card}>
-            <Image alt='product image' source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
+            <Image alt='product image' source={{ uri: "" }} style={styles.image} />
             <View className='Infomation' style={{ marginLeft: 50 }}>
               <Text style={{ fontSize: 25 }}>Lorem Ipsum</Text>

[Survived] ObjectLiteral
components/MyListingPage/DisplayMyListingPage.tsx:29:48
             <Text style={{ marginLeft: 'auto', marginRight: 25 }} className='Status'>Pending</Text>
           </View>
           <View className='Listing2' style={styles.card}>
-            <Image alt='product image' source={{ uri: 'https://archive.org/download/placeholder-image/placeholder-image.jpg' }} style={styles.image} />
+            <Image alt='product image' source={{}} style={styles.image} />
             <View className='Infomation' style={{ marginLeft: 50 }}>
               <Text style={{ fontSize: 25 }}>Lorem Ipsum</Text>

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:35:40
               <Text style={{ fontSize: 20 }}> Details about product</Text>
               <Text style={{ fontSize: 20 }}> $5.05 </Text>
             </View>
-            <Text style={{ marginLeft: 'auto', marginRight: 25 }} className='Status'>Sold</Text>
+            <Text style={{ marginLeft: "", marginRight: 25 }} className='Status'>Sold</Text>
           </View>
         </View>

[Survived] ObjectLiteral
components/MyListingPage/DisplayMyListingPage.tsx:48:11
     flex: 1,
     backgroundColor: 'white',
   },
-  header: {
-    fontSize: 40,
-    textAlign: 'center',
-    borderBottomColor: '#000',
-    borderBottomWidth: 5,
-  },
+  header: {},
   body: {
     display: 'flex',

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:50:16
   },
   header: {
     fontSize: 40,
-    textAlign: 'center',
+    textAlign: "",
     borderBottomColor: '#000',
     borderBottomWidth: 5,

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:51:24
   header: {
     fontSize: 40,
     textAlign: 'center',
-    borderBottomColor: '#000',
+    borderBottomColor: "",
     borderBottomWidth: 5,
   },

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:66:21
     flexDirection: 'row',
     margin: 100,
     gap: 500,
-    justifyContent: 'center',
+    justifyContent: "",
   },
   upper_button: {

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:70:20
   },
   upper_button: {
     display: 'flex',
-    flexDirection: 'row',
+    flexDirection: "",
     fontSize: 33,
     padding: 10,

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:79:14
     textAlign: 'center'
   },
   listings: {
-    display: 'flex',
+    display: "",
     flexDirection: 'column',
     justifyContent: 'center',

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:86:16
     height: 180,
     marginLeft: 50,
     marginRight: 50,
-    textAlign: 'center',
+    textAlign: "",
     gap: 30,
   },

[Survived] StringLiteral
components/MyListingPage/DisplayMyListingPage.tsx:93:18
     display: 'flex',
     flexDirection: 'row',
     justifyContent: 'center',
-    borderColor: "#000",
+    borderColor: "",
     borderWidth: 5,
     borderRadius: 10,
