[Survived] ArithmeticOperator
components/ProductImages.tsx:15:18
 
 export default function ProductImages({ images }: { images: string[] }) {
   const { width } = Dimensions.get("window");
-  const height = width * 0.7;
+  const height = width / 0.7;
 
   const [active, setActive] = useState(0);

[Survived] BlockStatement
components/ProductImages.tsx:19:78
 
   const [active, setActive] = useState(0);
 
-  const onScrollChange = (event: NativeSyntheticEvent<NativeScrollEvent>) => {
-    const { contentOffset, layoutMeasurement } = event.nativeEvent;
-
-    const slide = Math.ceil(contentOffset.x / layoutMeasurement.width);
-
-    if (slide !== active) {
-      setActive(slide);
-    }
-  };
+  const onScrollChange = (event: NativeSyntheticEvent<NativeScrollEvent>) => {};
 
   return (

[Survived] ArithmeticOperator
components/ProductImages.tsx:22:29
   const onScrollChange = (event: NativeSyntheticEvent<NativeScrollEvent>) => {
     const { contentOffset, layoutMeasurement } = event.nativeEvent;
 
-    const slide = Math.ceil(contentOffset.x / layoutMeasurement.width);
+    const slide = Math.ceil(contentOffset.x * layoutMeasurement.width);
 
     if (slide !== active) {

[Survived] ConditionalExpression
components/ProductImages.tsx:24:9
 
     const slide = Math.ceil(contentOffset.x / layoutMeasurement.width);
 
-    if (slide !== active) {
+    if (false) {
       setActive(slide);
     }

[Survived] EqualityOperator
components/ProductImages.tsx:24:9
 
     const slide = Math.ceil(contentOffset.x / layoutMeasurement.width);
 
-    if (slide !== active) {
+    if (slide === active) {
       setActive(slide);
     }

[Survived] UnaryOperator
components/ProductImages.tsx:34:27
       style={{
         width: width,
         backgroundColor: "white",
-        marginHorizontal: -16,
+        marginHorizontal: +16,
         marginBottom: 10,
       }}

[Survived] BooleanLiteral
components/ProductImages.tsx:42:41
         pagingEnabled
         horizontal
         onScroll={onScrollChange}
-        showsHorizontalScrollIndicator={false}
+        showsHorizontalScrollIndicator={true}
         style={{ width, height }}
       >

[Survived] ArrowFunction
components/ProductImages.tsx:45:21
         showsHorizontalScrollIndicator={false}
         style={{ width, height }}
       >
-        {images.map((image, index) => (
-          <Image
-            key={index}
-            source={{ uri: image }}
-            style={{
-              width,
-              height,
-              padding: 10,
-            }}
-          />
-        ))}
+        {images.map(() => undefined)}
       </ScrollView>
       <View style={styles.pagination}>

[Survived] ArrowFunction
components/ProductImages.tsx:58:21
         ))}
       </ScrollView>
       <View style={styles.pagination}>
-        {images.map((i, k) => (
-          <Text key={k} style={k == active ? styles.activeDot : styles.dot}>
-            •
-          </Text>
-        ))}
+        {images.map(() => undefined)}
       </View>
     </View>

[Survived] ConditionalExpression
components/ProductImages.tsx:59:32
       </ScrollView>
       <View style={styles.pagination}>
         {images.map((i, k) => (
-          <Text key={k} style={k == active ? styles.activeDot : styles.dot}>
+          <Text key={k} style={true ? styles.activeDot : styles.dot}>
             •
           </Text>

[Survived] EqualityOperator
components/ProductImages.tsx:59:32
       </ScrollView>
       <View style={styles.pagination}>
         {images.map((i, k) => (
-          <Text key={k} style={k == active ? styles.activeDot : styles.dot}>
+          <Text key={k} style={k != active ? styles.activeDot : styles.dot}>
             •
           </Text>

[Survived] UnaryOperator
components/ProductImages.tsx:72:13
   pagination: {
     flexDirection: "row",
     position: "absolute",
-    bottom: -0,
+    bottom: +0,
     alignSelf: "center",
     backgroundColor: "transparent",
