[Survived] ObjectLiteral
components/SellerCard.tsx:22:19
       {/* Profile Section */}
       <View style={styles.profileContainer}>
         <Image
-          source={{ uri: "https://via.placeholder.com/60" }} // Placeholder for profile image
+          source={{}} // Placeholder for profile image
           style={styles.profileImage}
         />

[Survived] ObjectLiteral
components/SellerCard.tsx:44:9
 }
 
 const styles = StyleSheet.create({
-  card: {
-    backgroundColor: "white",
-    padding: 15,
-    margin: 10,
-    elevation: 5,
-  },
+  card: {},
   profileContainer: {
     flexDirection: "row",

[Survived] StringLiteral
components/SellerCard.tsx:45:22
 
 const styles = StyleSheet.create({
   card: {
-    backgroundColor: "white",
+    backgroundColor: "",
     padding: 15,
     margin: 10,

[Survived] ObjectLiteral
components/SellerCard.tsx:50:21
     margin: 10,
     elevation: 5,
   },
-  profileContainer: {
-    flexDirection: "row",
-    alignItems: "center",
-    marginBottom: 10,
-  },
+  profileContainer: {},
   profileImage: {
     width: 60,

[Survived] ObjectLiteral
components/SellerCard.tsx:64:9
   infoContainer: {
     marginLeft: 10,
   },
-  name: {
-    fontSize: 18,
-    fontWeight: "bold",
-  },
+  name: {},
   location: {
     fontSize: 14,

[Survived] ObjectLiteral
components/SellerCard.tsx:73:15
     color: "gray",
     fontStyle: "italic",
   },
-  aboutTitle: {
-    fontSize: 14,
-    fontWeight: "500",
-    marginTop: 5,
-    fontStyle: "italic",
-  },
+  aboutTitle: {},
   aboutText: {
     fontSize: 14,

[Survived] StringLiteral
components/SellerCard.tsx:82:12
   aboutText: {
     fontSize: 14,
     fontStyle: "italic",
-    color: "#333",
+    color: "",
     marginBottom: 10,
   },
