[Killed] BlockStatement
components/StyledText.tsx:3:44
 import { Text, TextProps } from './Themed';
 
-export function MonoText(props: TextProps) {
-  return <Text {...props} style={[props.style, { fontFamily: 'SpaceMono' }]} />;
-}
+export function MonoText(props: TextProps) {}
 
killedBy: renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renders correctly 1`

Snapshot: <Text
  style={
    [
      {
