[Killed] BlockStatement
components/Themed.tsx:22:3
 export function useThemeColor(
   props: { light?: string; dark?: string },
   colorName: keyof typeof Colors.light & keyof typeof Colors.dark
-) {
-  const theme = useColorScheme() ?? 'light';
-  const colorFromProps = props[theme];
-
-  if (colorFromProps) {
-    return colorFromProps;
-  } else {
-    return Colors[theme][colorName];
-  }
-}
+) {}
 
 export function Text(props: TextProps) {
killedBy: renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,10 +1,10 @@

[Survived] LogicalOperator
components/Themed.tsx:23:17
   props: { light?: string; dark?: string },
   colorName: keyof typeof Colors.light & keyof typeof Colors.dark
 ) {
-  const theme = useColorScheme() ?? 'light';
+  const theme = useColorScheme() && 'light';
   const colorFromProps = props[theme];
 

[Killed] ConditionalExpression
components/Themed.tsx:26:7
   const theme = useColorScheme() ?? 'light';
   const colorFromProps = props[theme];
 
-  if (colorFromProps) {
+  if (true) {
     return colorFromProps;
   } else {
killedBy: renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,10 +1,10 @@

[Survived] BlockStatement
components/Themed.tsx:26:23
   const theme = useColorScheme() ?? 'light';
   const colorFromProps = props[theme];
 
-  if (colorFromProps) {
-    return colorFromProps;
-  } else {
+  if (colorFromProps) {} else {
     return Colors[theme][colorName];
   }

[Killed] BlockStatement
components/Themed.tsx:28:10
 
   if (colorFromProps) {
     return colorFromProps;
-  } else {
-    return Colors[theme][colorName];
-  }
+  } else {}
 }
 
killedBy: renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renders correctly 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,10 +1,10 @@

[Killed] BlockStatement
components/Themed.tsx:33:40
   }
 }
 
-export function Text(props: TextProps) {
-  const { style, lightColor, darkColor, ...otherProps } = props;
-  const color = useThemeColor({ light: lightColor, dark: darkColor }, 'text');
-
-  return <DefaultText style={[{ color }, style]} {...otherProps} />;
-}
+export function Text(props: TextProps) {}
 
 export function View(props: ViewProps) {
killedBy: renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `renders correctly 1`

Snapshot: <Text
  style={
    [
      {

[Survived] BlockStatement
components/Themed.tsx:40:40
   return <DefaultText style={[{ color }, style]} {...otherProps} />;
 }
 
-export function View(props: ViewProps) {
-  const { style, lightColor, darkColor, ...otherProps } = props;
-  const backgroundColor = useThemeColor({ light: lightColor, dark: darkColor }, 'background');
-
-  return <DefaultView style={[{ backgroundColor }, style]} {...otherProps} />;
-}
+export function View(props: ViewProps) {}
 

[Survived] ObjectLiteral
components/Themed.tsx:42:41
 
 export function View(props: ViewProps) {
   const { style, lightColor, darkColor, ...otherProps } = props;
-  const backgroundColor = useThemeColor({ light: lightColor, dark: darkColor }, 'background');
+  const backgroundColor = useThemeColor({}, 'background');
 
   return <DefaultView style={[{ backgroundColor }, style]} {...otherProps} />;

[Survived] ArrayDeclaration
components/Themed.tsx:44:30
   const { style, lightColor, darkColor, ...otherProps } = props;
   const backgroundColor = useThemeColor({ light: lightColor, dark: darkColor }, 'background');
 
-  return <DefaultView style={[{ backgroundColor }, style]} {...otherProps} />;
+  return <DefaultView style={[]} {...otherProps} />;
 }
 
