[Survived] BlockStatement
components/useClientOnlyValue.web.ts:5:71
 
 // `useEffect` is not invoked during server rendering, meaning
 // we can use this to determine if we're on the server or not.
-export function useClientOnlyValue<S, C>(server: S, client: C): S | C {
-  const [value, setValue] = React.useState<S | C>(server);
-  React.useEffect(() => {
-    setValue(client);
-  }, [client]);
-
-  return value;
-}
+export function useClientOnlyValue<S, C>(server: S, client: C): S | C {}
 

[Survived] BlockStatement
components/useClientOnlyValue.web.ts:7:25
 // we can use this to determine if we're on the server or not.
 export function useClientOnlyValue<S, C>(server: S, client: C): S | C {
   const [value, setValue] = React.useState<S | C>(server);
-  React.useEffect(() => {
-    setValue(client);
-  }, [client]);
+  React.useEffect(() => {}, [client]);
 
   return value;

[Survived] ArrayDeclaration
components/useClientOnlyValue.web.ts:9:6
   const [value, setValue] = React.useState<S | C>(server);
   React.useEffect(() => {
     setValue(client);
-  }, [client]);
+  }, []);
 
   return value;
