[Survived] BlockStatement
components/useColorScheme.web.ts:6:34
 // and the first render on the client. Typically, web developers will use CSS media queries
 // to render different styles on the client and server, these aren't directly supported in React Native
 // but can be achieved using a styling library like Nativewind.
-export function useColorScheme() {
-  return 'light';
-}
+export function useColorScheme() {}
 
