[Survived] BlockStatement
components/Wishlist/WishlistFilter.tsx:11:65
 const WishlistFilter: React.FC<WishlistFilterProps> = ({ onFilterChange }) => {
   const [selectedFilter, setSelectedFilter] = useState("");
 
-  const handleFilterPress = (filterType: string, value: any) => {
-    setSelectedFilter(`${filterType}-${value}`); // Store the selected filter
-    onFilterChange(filterType, value);
-  };
+  const handleFilterPress = (filterType: string, value: any) => {};
 
   return (

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:21:34
       <Text style={styles.filterTitle}>Filter By:</Text>
 
       {/* Availability Filter */}
-      <TouchableOpacity onPress={() => handleFilterPress("availability", "available")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "availability-available" && styles.selected]}>
           Available

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:21:58
       <Text style={styles.filterTitle}>Filter By:</Text>
 
       {/* Availability Filter */}
-      <TouchableOpacity onPress={() => handleFilterPress("availability", "available")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => handleFilterPress("", "available")} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "availability-available" && styles.selected]}>
           Available

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:22:42
 
       {/* Availability Filter */}
       <TouchableOpacity onPress={() => handleFilterPress("availability", "available")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "availability-available" && styles.selected]}>
+        <Text style={[styles.filterText, false]}>
           Available
         </Text>

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:22:42
 
       {/* Availability Filter */}
       <TouchableOpacity onPress={() => handleFilterPress("availability", "available")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "availability-available" && styles.selected]}>
+        <Text style={[styles.filterText, true]}>
           Available
         </Text>

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:27:34
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("availability", "unavailable")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "availability-unavailable" && styles.selected]}>
           Unavailable

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:28:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("availability", "unavailable")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "availability-unavailable" && styles.selected]}>
+        <Text style={[styles.filterText, true]}>
           Unavailable
         </Text>

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:28:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("availability", "unavailable")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "availability-unavailable" && styles.selected]}>
+        <Text style={[styles.filterText, true && styles.selected]}>
           Unavailable
         </Text>

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:36:34
       {/* Sorting Options */}
       <Text style={styles.filterTitle}>Sort By:</Text>
 
-      <TouchableOpacity onPress={() => handleFilterPress("price", "asc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "price-asc" && styles.selected]}>
           Price: Low to High

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:37:42
       <Text style={styles.filterTitle}>Sort By:</Text>
 
       <TouchableOpacity onPress={() => handleFilterPress("price", "asc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "price-asc" && styles.selected]}>
+        <Text style={[styles.filterText, true]}>
           Price: Low to High
         </Text>

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:37:42
       <Text style={styles.filterTitle}>Sort By:</Text>
 
       <TouchableOpacity onPress={() => handleFilterPress("price", "asc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "price-asc" && styles.selected]}>
+        <Text style={[styles.filterText, true && styles.selected]}>
           Price: Low to High
         </Text>

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:42:34
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("price", "desc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "price-desc" && styles.selected]}>
           Price: High to Low

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:42:58
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("price", "desc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => handleFilterPress("", "desc")} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "price-desc" && styles.selected]}>
           Price: High to Low

[Survived] EqualityOperator
components/Wishlist/WishlistFilter.tsx:43:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("price", "desc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "price-desc" && styles.selected]}>
+        <Text style={[styles.filterText, selectedFilter !== "price-desc" && styles.selected]}>
           Price: High to Low
         </Text>

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:43:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("price", "desc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "price-desc" && styles.selected]}>
+        <Text style={[styles.filterText, true]}>
           Price: High to Low
         </Text>

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:48:34
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("name", "asc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "name-asc" && styles.selected]}>
           Name: A-Z

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:49:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("name", "asc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "name-asc" && styles.selected]}>
+        <Text style={[styles.filterText, false]}>
           Name: A-Z
         </Text>

[Survived] EqualityOperator
components/Wishlist/WishlistFilter.tsx:49:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("name", "asc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "name-asc" && styles.selected]}>
+        <Text style={[styles.filterText, selectedFilter !== "name-asc" && styles.selected]}>
           Name: A-Z
         </Text>

[Survived] ArrowFunction
components/Wishlist/WishlistFilter.tsx:54:34
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("name", "desc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => undefined} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "name-desc" && styles.selected]}>
           Name: Z-A

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:54:58
         </Text>
       </TouchableOpacity>
 
-      <TouchableOpacity onPress={() => handleFilterPress("name", "desc")} style={styles.filterButton}>
+      <TouchableOpacity onPress={() => handleFilterPress("", "desc")} style={styles.filterButton}>
         <Text style={[styles.filterText, selectedFilter === "name-desc" && styles.selected]}>
           Name: Z-A

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:55:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("name", "desc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "name-desc" && styles.selected]}>
+        <Text style={[styles.filterText, false]}>
           Name: Z-A
         </Text>

[Survived] ConditionalExpression
components/Wishlist/WishlistFilter.tsx:55:42
       </TouchableOpacity>
 
       <TouchableOpacity onPress={() => handleFilterPress("name", "desc")} style={styles.filterButton}>
-        <Text style={[styles.filterText, selectedFilter === "name-desc" && styles.selected]}>
+        <Text style={[styles.filterText, true]}>
           Name: Z-A
         </Text>

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:66:15
 const styles = StyleSheet.create({
   filterContainer: {
     flexDirection: "row",
-    flexWrap: "wrap",
+    flexWrap: "",
     justifyContent: "center",
     paddingVertical: 10,

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:67:21
   filterContainer: {
     flexDirection: "row",
     flexWrap: "wrap",
-    justifyContent: "center",
+    justifyContent: "",
     paddingVertical: 10,
     backgroundColor: "#f0f0f0",

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:80:22
     width: "100%",
   },
   filterButton: {
-    backgroundColor: "#fff",
+    backgroundColor: "",
     paddingVertical: 6,
     paddingHorizontal: 12,

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:87:18
     marginHorizontal: 5,
     marginBottom: 5,
     borderWidth: 1,
-    borderColor: "#ccc",
+    borderColor: "",
   },
   filterText: {

[Survived] StringLiteral
components/Wishlist/WishlistFilter.tsx:91:12
   },
   filterText: {
     fontSize: 14,
-    color: "#333",
+    color: "",
   },
   selected: {

[Survived] ObjectLiteral
components/Wishlist/WishlistFilter.tsx:93:13
     fontSize: 14,
     color: "#333",
   },
-  selected: {
-    fontWeight: "bold",
-    color: "blue",
-  },
+  selected: {},
 });
 
