[Survived] BlockStatement
components/Wishlist/WishlistHeader.tsx:5:30
 import { View, Text, TouchableOpacity, StyleSheet } from "react-native";
 import { useRouter } from "expo-router";
 
-const WishlistHeader = () => {
-  const router = useRouter();
-
-  return (
-    <View style={styles.header}>
-      <TouchableOpacity onPress={() => router.back()}>
-        <Text style={styles.backButton}>←</Text>
-      </TouchableOpacity>
-      <Text style={styles.title}>My Wishlist</Text>
-      <TouchableOpacity>
-        <Text style={styles.sortButton}>Sort</Text>
-      </TouchableOpacity>
-    </View>
-  );
-};
+const WishlistHeader = () => {};
 
 const styles = StyleSheet.create({

[Survived] ObjectLiteral
components/Wishlist/WishlistHeader.tsx:22:11
 };
 
 const styles = StyleSheet.create({
-  header: {
-    flexDirection: "row",
-    alignItems: "center",
-    justifyContent: "space-between",
-    paddingVertical: 10,
-  },
+  header: {},
   backButton: { fontSize: 24, color: "black" },
   title: { fontSize: 20, fontWeight: "bold" },

[Survived] StringLiteral
components/Wishlist/WishlistHeader.tsx:25:21
   header: {
     flexDirection: "row",
     alignItems: "center",
-    justifyContent: "space-between",
+    justifyContent: "",
     paddingVertical: 10,
   },

[Survived] ObjectLiteral
components/Wishlist/WishlistHeader.tsx:28:15
     justifyContent: "space-between",
     paddingVertical: 10,
   },
-  backButton: { fontSize: 24, color: "black" },
+  backButton: {},
   title: { fontSize: 20, fontWeight: "bold" },
   sortButton: { fontSize: 16, color: "blue" },

[Survived] StringLiteral
components/Wishlist/WishlistHeader.tsx:28:38
     justifyContent: "space-between",
     paddingVertical: 10,
   },
-  backButton: { fontSize: 24, color: "black" },
+  backButton: { fontSize: 24, color: "" },
   title: { fontSize: 20, fontWeight: "bold" },
   sortButton: { fontSize: 16, color: "blue" },

[Survived] StringLiteral
components/Wishlist/WishlistHeader.tsx:29:38
     paddingVertical: 10,
   },
   backButton: { fontSize: 24, color: "black" },
-  title: { fontSize: 20, fontWeight: "bold" },
+  title: { fontSize: 20, fontWeight: "" },
   sortButton: { fontSize: 16, color: "blue" },
 });

[Survived] ObjectLiteral
components/Wishlist/WishlistHeader.tsx:29:10
     paddingVertical: 10,
   },
   backButton: { fontSize: 24, color: "black" },
-  title: { fontSize: 20, fontWeight: "bold" },
+  title: {},
   sortButton: { fontSize: 16, color: "blue" },
 });
