[Survived] BlockStatement
components/Wishlist/WishlistItem.tsx:15:75
   onRemove: (id: string) => void;
 }
 
-const WishlistItem: React.FC<WishlistItemProps> = ({ item, onRemove }) => {
-  return (
-    <View style={[styles.itemContainer, !item.available && styles.unavailable]}>
-      {/* Image on the Left */}
-      <Image source={item.image} style={styles.image} />
-
-      {/* Item Details & Buttons */}
-      <View style={styles.infoContainer}>
-        <Text style={styles.title}>{item.title}</Text>
-        <Text style={styles.price}>${item.price.toFixed(2)}</Text>
-
-        {/* Buttons Aligned to the Right */}
-        <View style={styles.buttonContainer}>
-          <TouchableOpacity style={styles.addButton}>
-            <Text style={styles.buttonText}>Add to Cart</Text>
-          </TouchableOpacity>
-          <TouchableOpacity style={styles.removeButton} onPress={() => onRemove(item.id)}>
-            <Text style={styles.buttonText}>Remove</Text>
-          </TouchableOpacity>
-        </View>
-      </View>
-    </View>
-  );
-};
+const WishlistItem: React.FC<WishlistItemProps> = ({ item, onRemove }) => {};
 
 const styles = StyleSheet.create({

[Survived] LogicalOperator
components/Wishlist/WishlistItem.tsx:17:41
 
 const WishlistItem: React.FC<WishlistItemProps> = ({ item, onRemove }) => {
   return (
-    <View style={[styles.itemContainer, !item.available && styles.unavailable]}>
+    <View style={[styles.itemContainer, !item.available || styles.unavailable]}>
       {/* Image on the Left */}
       <Image source={item.image} style={styles.image} />

[Survived] BooleanLiteral
components/Wishlist/WishlistItem.tsx:17:41
 
 const WishlistItem: React.FC<WishlistItemProps> = ({ item, onRemove }) => {
   return (
-    <View style={[styles.itemContainer, !item.available && styles.unavailable]}>
+    <View style={[styles.itemContainer, item.available && styles.unavailable]}>
       {/* Image on the Left */}
       <Image source={item.image} style={styles.image} />

[Survived] ArrowFunction
components/Wishlist/WishlistItem.tsx:31:66
           <TouchableOpacity style={styles.addButton}>
             <Text style={styles.buttonText}>Add to Cart</Text>
           </TouchableOpacity>
-          <TouchableOpacity style={styles.removeButton} onPress={() => onRemove(item.id)}>
+          <TouchableOpacity style={styles.removeButton} onPress={() => undefined}>
             <Text style={styles.buttonText}>Remove</Text>
           </TouchableOpacity>

[Survived] ObjectLiteral
components/Wishlist/WishlistItem.tsx:41:18
 };
 
 const styles = StyleSheet.create({
-  itemContainer: {
-    flexDirection: "row", // Makes items appear in a row
-    backgroundColor: "#f9f9f9",
-    padding: 10,
-    borderRadius: 8,
-    marginBottom: 10,
-    alignItems: "center", // Align items in the center
-  },
+  itemContainer: {},
   unavailable: {
     opacity: 0.5,

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:47:17
     padding: 10,
     borderRadius: 8,
     marginBottom: 10,
-    alignItems: "center", // Align items in the center
+    alignItems: "", // Align items in the center
   },
   unavailable: {

[Survived] ObjectLiteral
components/Wishlist/WishlistItem.tsx:63:10
     flexDirection: "column",
     justifyContent: "space-between",
   },
-  title: {
-    fontSize: 16,
-    fontWeight: "bold",
-    marginBottom: 5,
-  },
+  title: {},
   price: {
     fontSize: 14,

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:74:20
     marginBottom: 10,
   },
   buttonContainer: {
-    flexDirection: "row",
+    flexDirection: "",
     justifyContent: "flex-start", // Align buttons on the right side
     gap: 10, // Space between buttons

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:75:21
   },
   buttonContainer: {
     flexDirection: "row",
-    justifyContent: "flex-start", // Align buttons on the right side
+    justifyContent: "", // Align buttons on the right side
     gap: 10, // Space between buttons
   },

[Survived] ObjectLiteral
components/Wishlist/WishlistItem.tsx:78:14
     justifyContent: "flex-start", // Align buttons on the right side
     gap: 10, // Space between buttons
   },
-  addButton: {
-    backgroundColor: "green",
-    padding: 10,
-    borderRadius: 5,
-    flex: 1, // Makes buttons equal width
-  },
+  addButton: {},
   removeButton: {
     backgroundColor: "red",

[Survived] ObjectLiteral
components/Wishlist/WishlistItem.tsx:84:17
     borderRadius: 5,
     flex: 1, // Makes buttons equal width
   },
-  removeButton: {
-    backgroundColor: "red",
-    padding: 10,
-    borderRadius: 5,
-    flex: 1, // Makes buttons equal width
-  },
+  removeButton: {},
   buttonText: {
     color: "white",

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:85:22
     flex: 1, // Makes buttons equal width
   },
   removeButton: {
-    backgroundColor: "red",
+    backgroundColor: "",
     padding: 10,
     borderRadius: 5,

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:91:12
     flex: 1, // Makes buttons equal width
   },
   buttonText: {
-    color: "white",
+    color: "",
     textAlign: "center",
     fontWeight: "bold",

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:92:16
   },
   buttonText: {
     color: "white",
-    textAlign: "center",
+    textAlign: "",
     fontWeight: "bold",
   },

[Survived] StringLiteral
components/Wishlist/WishlistItem.tsx:93:17
   buttonText: {
     color: "white",
     textAlign: "center",
-    fontWeight: "bold",
+    fontWeight: "",
   },
 });
