[Survived] EqualityOperator
firebase/firebase.config.tsx:13:5
   storageBucket: process.env.EXPO_PUBLIC_FIREBASE_STORAGE_BUCKET,
   messagingSenderId: process.env.EXPO_PUBLIC_FIREBASE_MESSAGING_SENDER_ID,
   appId:
-    Platform.OS === 'ios'
+    Platform.OS !== 'ios'
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_IOS // ID para iOS
       : Platform.OS === 'android'

[Survived] ConditionalExpression
firebase/firebase.config.tsx:13:5
   storageBucket: process.env.EXPO_PUBLIC_FIREBASE_STORAGE_BUCKET,
   messagingSenderId: process.env.EXPO_PUBLIC_FIREBASE_MESSAGING_SENDER_ID,
   appId:
-    Platform.OS === 'ios'
+    true
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_IOS // ID para iOS
       : Platform.OS === 'android'

[Survived] ConditionalExpression
firebase/firebase.config.tsx:15:9
   appId:
     Platform.OS === 'ios'
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_IOS // ID para iOS
-      : Platform.OS === 'android'
+      : false
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_ANDROID // ID para Android
       : process.env.EXPO_PUBLIC_FIREBASE_APP_ID_WEB, // ID para Web (solo en web apps),

[Survived] ConditionalExpression
firebase/firebase.config.tsx:15:9
   appId:
     Platform.OS === 'ios'
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_IOS // ID para iOS
-      : Platform.OS === 'android'
+      : true
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_ANDROID // ID para Android
       : process.env.EXPO_PUBLIC_FIREBASE_APP_ID_WEB, // ID para Web (solo en web apps),

[Survived] ConditionalExpression
firebase/firebase.config.tsx:18:7
       : Platform.OS === 'android'
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_ANDROID // ID para Android
       : process.env.EXPO_PUBLIC_FIREBASE_APP_ID_WEB, // ID para Web (solo en web apps),
-  ...(Platform.OS === 'web' && { measurementId: process.env.EXPO_PUBLIC_FIREBASE_MEASUREMENT_ID }),
+  ...(false),
 };
 

[Survived] LogicalOperator
firebase/firebase.config.tsx:18:7
       : Platform.OS === 'android'
       ? process.env.EXPO_PUBLIC_FIREBASE_APP_ID_ANDROID // ID para Android
       : process.env.EXPO_PUBLIC_FIREBASE_APP_ID_WEB, // ID para Web (solo en web apps),
-  ...(Platform.OS === 'web' && { measurementId: process.env.EXPO_PUBLIC_FIREBASE_MEASUREMENT_ID }),
+  ...(Platform.OS === 'web' || {
+  measurementId: process.env.EXPO_PUBLIC_FIREBASE_MEASUREMENT_ID
+}),
 };
 

[Survived] ConditionalExpression
firebase/firebase.config.tsx:23:21
 
 
 // Inicializa Firebase si no está inicializado
-const firebaseApp = getApps().length === 0 ? initializeApp(firebaseConfig) : getApp();
+const firebaseApp = false ? initializeApp(firebaseConfig) : getApp();
 const auth = getAuth(firebaseApp);
 

[Survived] EqualityOperator
firebase/firebase.config.tsx:23:21
 
 
 // Inicializa Firebase si no está inicializado
-const firebaseApp = getApps().length === 0 ? initializeApp(firebaseConfig) : getApp();
+const firebaseApp = getApps().length !== 0 ? initializeApp(firebaseConfig) : getApp();
 const auth = getAuth(firebaseApp);
 
