[Killed] BlockStatement
utils/lib.ts:4:40
 // Utility functions that are used throughout the application
 
 
-function formatCurrency(price: number) {
-  return `$${price.toFixed(2).replace(/\d(?=(\d{3})+\.)/g, '$&,')}`
-} 
+function formatCurrency(price: number) {} 
 
 
killedBy: formatPrice helper function should return formatted price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$1,000.00"
Received: undefined

[Killed] Regex
utils/lib.ts:5:39
 
 
 function formatCurrency(price: number) {
-  return `$${price.toFixed(2).replace(/\d(?=(\d{3})+\.)/g, '$&,')}`
+  return `$${price.toFixed(2).replace(/\D(?=(\d{3})+\.)/g, '$&,')}`
 } 
 
killedBy: formatPrice helper function should return formatted price
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$1,000.00"
Received: "$1000.00"
